Object.defineProperty(exports, "__esModule", {
  value: !0
}), exports.default = {
  "0-0": {
    yi: ["嫁娶", "会亲友", "出行", "立券", "交易", "纳财", "开市", "动土", "祈福", "祭祀", "掘井", "开光", "求嗣"],
    ji: ["入宅", "纳畜", "安葬", "造畜稠", "作灶", "伐木", "作梁"]
  },
  "0-1": {
    yi: ["嫁娶", "解除", "移徙", "纳采", "入宅", "裁衣", "订盟", "动土", "祈福", "纳畜", "盖屋", "安门", "祭祀", "牧养", "修造", "拆卸", "起基", "安香", "酬神", "出火", "伐木", "开光", "求嗣", "上梁", "竖柱", "塑绘", "斋醮", "定磉"],
    ji: ["栽种", "安葬"]
  },
  "0-10": {
    yi: ["解除", "纳采", "置产", "订盟", "动土", "祈福", "栽种", "安床", "纳畜", "安门", "祭祀", "修造", "造畜稠", "拆卸", "移柩", "掘井", "开池", "立碑", "破土", "求嗣", "上梁", "竖柱", "塑绘"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "开市", "赴任", "安葬", "入殓", "出火", "进人口"]
  },
  "0-11": {
    yi: ["出行", "纳采", "立券", "开市", "裁衣", "订盟", "祈福", "安机械", "沐浴", "纳畜", "祭祀", "安碓磑", "斋醮"],
    ji: ["嫁娶", "栽种", "安葬", "入殓"]
  },
  "0-12": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "开市", "动土", "祈福", "祭祀", "破土", "启鑽"],
    ji: ["移徙", "入宅", "安葬", "安门", "出火"]
  },
  "0-13": {
    yi: ["出行", "解除", "入学", "纳采", "入宅", "习艺", "订盟", "动土", "祈福", "沐浴", "祭祀", "修造", "拆卸", "起基", "移柩", "安香", "成服", "除服", "伐木", "掘井", "求嗣", "上梁", "竖柱", "塑绘", "谢土", "造庙", "斋醮"],
    ji: ["开市", "盖屋", "安葬", "作灶"]
  },
  "0-14": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "立券", "入宅", "开市", "纳畜", "牧养", "出火"],
    ji: ["动土", "祈福", "安葬", "入殓", "破土"]
  },
  "0-15": {
    yi: ["嫁娶", "出行", "立券", "交易", "开市", "祈福", "安床", "祭祀", "拆卸", "开光", "求嗣"],
    ji: ["移徙", "入宅", "动土", "纳畜", "安葬", "安门", "入殓", "探病", "伐木", "上梁"]
  },
  "0-16": {
    yi: ["会亲友", "解除", "移徙", "入宅", "动土", "祈福", "祭祀", "求医", "治病", "合寿木", "开生坟", "安香", "破土", "求嗣", "斋醮"],
    ji: ["经络", "安葬", "入殓", "上梁", "合帐"]
  },
  "0-17": {
    yi: ["理发", "开市", "祈福", "祭祀", "牧养", "开光", "求嗣"],
    ji: ["嫁娶", "出行", "入宅", "安葬", "作灶", "入殓", "冠笄", "上梁"]
  },
  "0-18": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "纳采", "纳财", "开市", "出货财", "订盟", "动土", "开仓", "纳畜", "祭祀", "牧养", "修造", "开池", "开光", "破土", "普渡", "启鑽", "上梁", "竖柱", "斋醮"],
    ji: ["入宅", "盖屋", "安葬", "安门", "出火"]
  },
  "0-19": {
    yi: ["祭祀", "修坟", "成服", "除服", "立碑", "启鑽"],
    ji: ["馀事勿取"]
  },
  "0-2": {
    yi: ["嫁娶", "出行", "解除", "纳采", "立券", "交易", "置产", "开市", "订盟", "动土", "栽种", "安床", "挂匾", "修造", "拆卸", "安香", "出火", "开光"],
    ji: ["安葬", "祭祀", "作灶", "入殓"]
  },
  "0-20": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "订盟", "祈福", "祭祀", "求医", "治病", "出火"],
    ji: ["开市", "出货财", "安床", "开仓", "安葬", "安门"]
  },
  "0-21": {
    yi: ["解除"],
    ji: ["馀事勿取"]
  },
  "0-22": {
    yi: ["解除", "纳采", "订盟", "动土", "祈福", "栽种", "盖屋", "归岫", "架马", "修造", "起基", "成服", "除服", "合嵴", "掘井", "开柱眼", "破土", "上梁", "斋醮"],
    ji: ["移徙", "入宅", "开市", "安葬"]
  },
  "0-23": {
    yi: ["移徙", "立券", "交易", "入宅", "纳财", "开市", "动土", "祈福", "安床", "纳畜", "造畜稠", "开光", "求嗣"],
    ji: ["嫁娶", "理发", "栽种", "安葬", "作灶", "入殓", "行丧", "造庙", "造桥"]
  },
  "0-24": {
    yi: ["嫁娶", "出行", "纳采", "立券", "交易", "开市", "裁衣", "订盟", "动土", "祈福", "沐浴", "祭祀", "放水", "移柩", "冠笄", "安碓磑", "成服", "除服", "开光", "破土", "启鑽", "求嗣", "塑绘"],
    ji: ["入宅", "安葬", "作灶", "上梁"]
  },
  "0-25": {
    yi: ["嫁娶", "移徙", "入宅", "动土", "祈福", "安床", "祭祀", "拆卸", "出火", "开光", "破土", "求嗣", "谢土"],
    ji: ["开市", "安葬", "入殓", "合帐"]
  },
  "0-26": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "立券", "交易", "纳财", "开市", "赴任", "订盟", "动土", "栽种", "移柩", "除服", "进人口", "破土", "启鑽", "谢土"],
    ji: ["入宅", "安床", "安葬", "入殓"]
  },
  "0-27": {
    yi: ["出行", "立券", "交易", "置产", "开市", "动土", "祈福", "栽种", "安床", "纳畜", "祭祀", "造仓", "起基", "修坟", "开光", "破土", "启鑽", "求嗣", "定磉"],
    ji: ["移徙", "入宅", "盖屋", "安葬", "安门", "修造", "入殓", "伐木"]
  },
  "0-28": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "动土", "祈福", "祭祀", "求医", "治病"],
    ji: ["开市", "安门"]
  },
  "0-29": {
    yi: ["嫁娶", "纳采", "裁衣", "订盟", "动土", "祈福", "安床", "纳畜", "盖屋", "祭祀", "牧养", "修造", "作灶", "起基", "冠笄", "开光", "求嗣", "上梁", "作梁"],
    ji: ["出行", "移徙", "词讼", "栽种", "安葬", "行丧", "破土"]
  },
  "0-3": {
    yi: ["纳采", "立券", "交易", "订盟", "动土", "祭祀", "破土"],
    ji: ["嫁娶", "安葬"]
  },
  "0-30": {
    yi: ["嫁娶", "出行", "纳采", "立券", "交易", "开市", "裁衣", "订盟", "动土", "祈福", "栽种", "安床", "放水", "移柩", "成服", "除服", "掘井", "开渠", "破土"],
    ji: [""]
  },
  "0-31": {
    yi: ["祭祀", "修坟", "移柩", "馀事勿取", "成服", "除服", "启鑽"],
    ji: ["嫁娶", "入宅", "开市", "动土", "安葬", "破土"]
  },
  "0-32": {
    yi: ["嫁娶", "纳采", "入宅", "赴任", "订盟", "祈福", "沐浴", "纳畜", "祭祀", "拆卸", "移柩", "出火", "启鑽", "竖柱", "谢土", "斋醮"],
    ji: ["安床", "安葬", "作灶", "入殓"]
  },
  "0-33": {
    yi: ["嫁娶", "出行", "解除", "立券", "交易", "开市", "动土", "祈福", "挂匾", "祭祀", "拆卸", "冠笄", "开光", "破土", "求嗣", "斋醮"],
    ji: ["会亲友", "理发", "入宅", "安葬", "安门", "修造", "作灶", "入殓", "伐木", "上梁"]
  },
  "0-34": {
    yi: ["纳采", "订盟", "动土", "祈福", "祭祀", "修造", "破土", "上梁"],
    ji: ["嫁娶", "作灶"]
  },
  "0-35": {
    yi: ["会亲友", "入学", "纳采", "订盟", "祈福", "沐浴", "纳畜", "祭祀", "牧养", "造畜稠", "治病", "安碓磑", "进人口", "掘井", "开池", "求嗣", "斋醮"],
    ji: ["嫁娶", "入宅", "安葬", "行丧", "合帐"]
  },
  "0-36": {
    yi: ["出行", "纳采", "立券", "交易", "纳财", "开市", "裁衣", "订盟", "祈福", "沐浴", "祭祀", "移柩", "冠笄", "除服", "求嗣", "谢土", "斋醮"],
    ji: ["入宅", "安葬", "作灶", "入殓"]
  },
  "0-37": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "安床", "安门", "祭祀", "修造", "移柩", "出火", "立碑", "破土", "上梁"],
    ji: ["交易", "开市", "安葬", "合帐"]
  },
  "0-38": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "栽种", "安床", "挂匾", "拆卸", "出火", "进人口", "开光"],
    ji: ["祈福", "安葬", "祭祀", "作灶", "入殓", "探病"]
  },
  "0-39": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "立券", "交易", "开市", "习艺", "订盟", "动土", "祈福", "栽种", "祭祀", "造仓", "拆卸", "放水", "起基", "修坟", "安碓磑", "开池", "开光", "开渠", "立碑", "破土", "启鑽", "求嗣", "谢土"],
    ji: ["入宅", "安葬", "安门"]
  },
  "0-4": {
    yi: ["嫁娶", "出行", "解除", "纳采", "订盟", "动土", "祈福", "栽种", "安床", "造车器", "祭祀", "修造", "拆卸", "冠笄", "出火", "伐木", "开光", "破土", "求嗣", "上梁"],
    ji: ["置产", "入宅", "安葬", "行丧"]
  },
  "0-40": {
    yi: ["嫁娶", "出行", "解除", "移徙", "入宅", "祈福", "栽种", "安床", "祭祀", "修造", "拆卸", "移柩", "出火", "伐木", "开光", "求嗣", "上梁"],
    ji: ["立券", "交易", "开市", "安葬"]
  },
  "0-41": {
    yi: ["嫁娶", "纳采", "习艺", "订盟", "安床", "沐浴", "纳畜", "盖屋", "挂匾", "祭祀", "治病", "作灶", "安碓磑", "出火", "伐木", "掘井", "开光", "上梁", "竖柱", "塑绘"],
    ji: ["出行", "安葬", "造桥"]
  },
  "0-42": {
    yi: ["嫁娶", "出行", "动土", "祈福", "安床", "祭祀", "掘井", "破土", "启鑽", "求嗣"],
    ji: ["入宅", "盖屋", "安门", "修造", "入殓", "伐木", "上梁", "作梁"]
  },
  "0-43": {
    yi: ["会亲友", "解除", "入学", "祭祀", "取渔", "移柩", "成服", "除服", "结网", "启鑽", "畋猎"],
    ji: ["开市", "动土", "祈福", "安葬", "入殓", "破土", "造船"]
  },
  "0-44": {
    yi: ["出行", "解除", "置产", "开市", "动土", "祈福", "栽种", "祭祀", "起基", "开光", "求嗣"],
    ji: ["嫁娶", "入宅", "安床", "安葬", "安门", "作灶", "修坟", "立碑"]
  },
  "0-45": {
    yi: ["出行", "入学", "置产", "纳财", "开市", "动土", "祈福", "栽种", "纳畜", "祭祀", "牧养", "拆卸", "起基", "问名", "掘井", "开渠", "破土", "启鑽", "求嗣", "斋醮", "定磉"],
    ji: ["移徙", "入宅", "安葬", "入殓", "出火"]
  },
  "0-46": {
    yi: ["解除", "动土", "祈福", "栽种", "安床", "纳畜", "祭祀", "移柩", "掘井", "开光", "破土", "作梁"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "赴任", "盖屋", "安葬", "入殓", "出火", "进人口"]
  },
  "0-47": {
    yi: ["会亲友", "纳采", "立券", "交易", "开市", "订盟", "安床", "沐浴", "架马", "安门", "祭祀", "牧养", "造畜稠", "拆卸", "出火", "伐木", "掘井", "开光", "开柱眼", "上梁", "竖柱", "塑绘", "斋醮", "作梁"],
    ji: ["嫁娶", "出行", "动土", "安葬", "行丧", "造庙"]
  },
  "0-48": {
    yi: ["嫁娶", "解除", "动土", "祈福", "栽种", "安床", "祭祀", "掘井", "开池", "开光", "破土", "启鑽", "求嗣"],
    ji: ["出行", "入宅", "纳畜", "安葬", "作灶", "出火", "伐木"]
  },
  "0-49": {
    yi: ["出行", "解除", "移徙", "入宅", "祈福", "纳畜", "盖屋", "架马", "牧养", "修造", "起基", "移柩", "成服", "除服", "伐木", "开光", "求嗣", "谢土", "造庙"],
    ji: ["纳采", "交易", "开市", "动土", "安门"]
  },
  "0-5": {
    yi: ["嫁娶", "移徙", "立券", "入宅", "开市", "动土", "祈福", "祭祀"],
    ji: ["安葬", "造庙"]
  },
  "0-50": {
    yi: ["嫁娶", "出行", "解除", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "安床", "拆卸", "出火", "开光", "破土", "求嗣", "谢土"],
    ji: ["安葬", "祭祀", "入殓", "探病"]
  },
  "0-51": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "理发", "纳采", "习艺", "订盟", "动土", "祈福", "安床", "纳畜", "祭祀", "牧养", "修造", "拆卸", "放水", "起基", "修坟", "成服", "除服", "立碑", "破土", "求嗣", "竖柱", "斋醮", "针灸", "定磉"],
    ji: ["入宅", "开市", "盖屋", "探病", "出火"]
  },
  "0-52": {
    yi: ["解除", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "0-53": {
    yi: ["嫁娶", "会亲友", "纳畜", "祭祀", "牧养", "求医", "治病", "放水", "安碓磑", "掘井", "开光", "开渠", "塑绘"],
    ji: ["入学", "入宅", "盖屋", "安葬", "作灶", "行丧"]
  },
  "0-54": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "祈福", "栽种", "安床", "祭祀", "移柩", "成服", "除服", "进人口", "开光", "求嗣"],
    ji: ["移徙", "置产", "入宅", "纳畜", "盖屋", "安葬", "入殓", "伐木"]
  },
  "0-55": {
    yi: ["会亲友", "解除", "祭祀", "移柩", "捕捉", "成服", "除服", "普渡", "启鑽", "畋猎"],
    ji: ["嫁娶", "开市", "动土", "安葬", "掘井", "开池"]
  },
  "0-56": {
    yi: ["嫁娶", "出行", "解除", "移徙", "立券", "交易", "入宅", "纳财", "开市", "祈福", "栽种", "挂匾", "祭祀", "出火", "进人口", "开光", "破土", "求嗣", "谢土"],
    ji: ["安床", "安葬"]
  },
  "0-57": {
    yi: ["出行", "解除", "扫舍", "理发", "动土", "祈福", "沐浴", "祭祀", "拆卸", "起基", "移柩", "冠笄", "安碓磑", "成服", "除服", "掘井", "开池", "立碑", "启鑽", "求嗣", "谢土", "斋醮", "定磉"],
    ji: ["移徙", "入宅", "安葬", "安门", "作梁"]
  },
  "0-58": {
    yi: ["置产", "动土", "祈福", "栽种", "安床", "祭祀", "修造", "拆卸", "开光", "破土", "求嗣", "上梁"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "赴任", "安葬", "入殓", "进人口", "开渠"]
  },
  "0-59": {
    yi: ["会亲友", "沐浴", "造畜稠", "作灶", "放水", "冠笄", "开光", "塑绘"],
    ji: ["嫁娶", "出行", "安葬", "入殓"]
  },
  "0-6": {
    yi: ["嫁娶", "出行", "理发", "纳采", "订盟", "动土", "栽种", "安床", "祭祀", "放水", "进人口", "开光", "开渠"],
    ji: ["入宅", "纳畜", "盖屋", "安葬", "安门", "作灶", "入殓", "探病", "伐木", "上梁"]
  },
  "0-7": {
    yi: ["诸事不宜"],
    ji: ["交易", "开市", "安葬", "入殓"]
  },
  "0-8": {
    yi: ["嫁娶", "出行", "扫舍", "入学", "置产", "出货财", "动土", "祈福", "栽种", "开仓", "祭祀", "牧养", "求医", "治病", "开生坟", "起基", "开光", "立碑", "破土", "求嗣", "上梁", "竖柱", "谢土", "斋醮"],
    ji: ["入宅", "裁衣", "安床", "安葬", "安门"]
  },
  "0-9": {
    yi: [""],
    ji: ["诸事不宜"]
  },
  "1-0": {
    yi: ["出行", "纳采", "裁衣", "订盟", "祈福", "安床", "沐浴", "挂匾", "祭祀", "造畜稠", "拆卸", "起基", "入殓", "移柩", "成服", "除服", "启鑽", "求嗣", "上梁", "竖柱", "斋醮", "合帐"],
    ji: ["嫁娶", "移徙", "入宅", "开仓"]
  },
  "1-1": {
    yi: ["祈福", "纳畜", "祭祀", "入殓", "成服", "除服", "启鑽", "求嗣", "谢土"],
    ji: ["嫁娶", "出行", "入宅", "动土", "栽种", "开光", "破土", "针灸"]
  },
  "1-10": {
    yi: ["出行", "纳采", "订盟", "祈福", "安葬", "入殓", "移柩", "结网", "立碑", "破土", "斋醮"],
    ji: ["入宅", "作灶"]
  },
  "1-11": {
    yi: ["出行", "移徙", "入宅", "动土", "安门", "修造", "造仓", "造畜稠", "起基", "补垣", "进人口", "塞穴", "上梁"],
    ji: ["嫁娶", "开市", "祈福", "栽种", "安床", "安葬", "掘井", "开光"]
  },
  "1-12": {
    yi: ["交易", "经络", "祈福", "安床", "安机械", "沐浴", "造车器", "安葬", "祭祀", "入殓", "移柩", "立碑", "启鑽", "斋醮", "合帐"],
    ji: ["嫁娶", "入宅", "作灶", "掘井"]
  },
  "1-13": {
    yi: ["祈福", "安葬", "祭祀", "入殓", "移柩", "成服", "除服", "启鑽", "求嗣", "斋醮"],
    ji: ["嫁娶", "动土", "盖屋", "开光", "破土"]
  },
  "1-14": {
    yi: ["纳采", "立券", "交易", "纳财", "裁衣", "订盟", "经络", "安床", "安机械", "纳畜", "架马", "安葬", "造仓", "拆卸", "入殓", "修坟", "移柩", "冠笄", "补垣", "成服", "除服", "伐木", "立碑", "破土", "启鑽", "塞穴", "筑堤", "合帐"],
    ji: ["嫁娶", "入宅", "祭祀", "开光"]
  },
  "1-15": {
    yi: ["交易", "纳财", "祈福", "祭祀", "作灶", "冠笄", "求嗣", "斋醮"],
    ji: ["嫁娶", "安葬", "安门", "探病", "掘井", "开光"]
  },
  "1-16": {
    yi: ["嫁娶", "出行", "移徙", "入宅", "动土", "祈福", "栽种", "安床", "安葬", "祭祀", "修造", "作灶", "拆卸", "出火", "破土", "求嗣", "塞穴"],
    ji: ["开仓", "掘井", "开光"]
  },
  "1-17": {
    yi: ["嫁娶", "移徙", "入宅", "动土", "纳畜", "架马", "牧养", "修造", "作灶", "起基", "冠笄", "补垣", "开池", "塞穴", "造船", "定磉"],
    ji: ["开市", "祈福", "安葬", "掘井", "开光"]
  },
  "1-18": {
    yi: ["安葬", "祭祀", "入殓", "移柩", "成服", "除服", "破土", "启鑽", "谢土"],
    ji: ["馀事勿取"]
  },
  "1-19": {
    yi: ["嫁娶", "祈福", "安葬", "祭祀", "入殓", "补垣", "成服", "除服", "断蚁", "普渡", "塞穴", "筑堤"],
    ji: ["动土", "词讼", "掘井", "开光", "破土", "上梁"]
  },
  "1-2": {
    yi: ["纳采", "订盟", "动土", "安床", "安葬", "修造", "造仓", "拆卸", "入殓", "移柩", "冠笄", "成服", "除服", "破土", "启鑽"],
    ji: ["嫁娶", "入宅", "开市", "作灶", "开光"]
  },
  "1-20": {
    yi: ["嫁娶", "出行", "移徙", "动土", "安葬", "修造", "拆卸", "修坟", "伐木", "立碑", "破土"],
    ji: ["入宅", "开市", "祈福", "安床", "挂匾", "掘井", "开光"]
  },
  "1-21": {
    yi: ["扫舍", "整手足甲", "理发", "沐浴", "祭祀", "作灶", "入殓", "冠笄", "补垣", "破土", "启鑽", "塞穴"],
    ji: ["嫁娶", "会亲友", "栽种", "安葬", "开光", "针灸"]
  },
  "1-22": {
    yi: ["安床", "祭祀", "入殓", "移柩", "补垣", "开池", "破土", "启鑽"],
    ji: ["嫁娶", "移徙", "入宅", "开市", "作灶", "出火", "进人口", "掘井", "开光"]
  },
  "1-23": {
    yi: ["移徙", "纳采", "入宅", "裁衣", "订盟", "动土", "栽种", "开仓", "沐浴", "纳畜", "开厕", "安门", "祭祀", "修造", "拆卸", "冠笄", "补垣", "塞穴", "筑堤", "合帐"],
    ji: ["嫁娶", "祈福", "安葬", "行丧", "掘井", "开光"]
  },
  "1-24": {
    yi: ["立券", "交易", "裁衣", "安床", "安葬", "入殓", "移柩", "成服", "除服"],
    ji: ["嫁娶", "出行", "置产", "入宅", "动土", "栽种", "治病", "开光", "破土"]
  },
  "1-25": {
    yi: ["立券", "交易", "裁衣", "祈福", "安床", "祭祀", "入殓", "移柩", "成服", "酬神", "除服", "启鑽", "求嗣", "谢土"],
    ji: ["嫁娶", "出行", "入宅", "动土"]
  },
  "1-26": {
    yi: ["立券", "交易", "动土", "栽种", "安床", "纳畜", "安葬", "牧养", "修造", "拆卸", "入殓", "伐木", "上梁"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "安门", "祭祀", "出火", "开光"]
  },
  "1-27": {
    yi: ["裁衣", "祈福", "安床", "安葬", "祭祀", "造畜稠", "入殓", "移柩", "成服", "除服", "立碑", "破土", "启鑽", "谢土", "合帐"],
    ji: ["嫁娶", "纳采", "安门", "掘井"]
  },
  "1-28": {
    yi: ["嫁娶", "立券", "交易", "开厕", "取渔", "开生坟", "补垣", "塞穴", "畋猎"],
    ji: ["移徙", "入宅", "开市", "安床", "修造", "开光", "开渠", "上梁"]
  },
  "1-29": {
    yi: ["移徙", "入宅", "裁衣", "纳畜", "作灶"],
    ji: ["嫁娶", "安葬"]
  },
  "1-3": {
    yi: ["出行", "动土", "安床", "安葬", "祭祀", "修造", "造畜稠", "合寿木", "开生坟", "入殓", "移柩", "补垣", "破土", "启鑽", "塞穴", "合帐"],
    ji: ["移徙", "理发", "入宅", "安门", "作灶", "开光"]
  },
  "1-30": {
    yi: ["经络", "沐浴", "祭祀", "入殓", "移柩", "补垣", "成服", "除服", "立碑", "启鑽", "塞穴"],
    ji: ["嫁娶", "安葬", "治病", "掘井", "开光", "破土"]
  },
  "1-31": {
    yi: ["嫁娶", "移徙", "入宅", "祈福", "祭祀", "作灶", "斋醮"],
    ji: ["动土", "破土"]
  },
  "1-32": {
    yi: ["嫁娶", "解除", "扫舍", "安机械", "沐浴", "纳畜", "架马", "安葬", "安门", "牧养", "合寿木", "修坟", "冠笄", "伐木", "立碑", "启鑽", "作梁"],
    ji: ["入宅", "开市", "动土", "祈福", "开光"]
  },
  "1-33": {
    yi: ["嫁娶", "安机械", "安葬", "祭祀", "入殓", "破土"],
    ji: ["动土", "上梁"]
  },
  "1-34": {
    yi: ["嫁娶", "裁衣", "安床", "造畜稠", "入殓", "移柩", "破土", "合帐"],
    ji: ["置产", "作灶", "掘井", "开光", "造船"]
  },
  "1-35": {
    yi: ["出行", "理发", "沐浴", "补垣", "塞穴"],
    ji: ["入宅", "安葬"]
  },
  "1-36": {
    yi: ["交易", "纳财", "祈福", "沐浴", "安葬", "祭祀", "造畜稠", "入殓", "修坟", "移柩", "问名", "教牛马", "立碑", "求嗣", "谢土"],
    ji: ["嫁娶", "置产", "入宅", "开市", "动土", "栽种", "开光", "破土"]
  },
  "1-37": {
    yi: ["祈福", "安葬", "祭祀", "入殓", "移柩", "启鑽", "求嗣"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "动土", "作灶", "掘井", "开光", "针灸"]
  },
  "1-38": {
    yi: ["立券", "交易", "动土", "安机械", "安葬", "修造", "入殓", "冠笄", "破土"],
    ji: ["嫁娶", "入宅", "祈福", "出火"]
  },
  "1-39": {
    yi: ["嫁娶", "出行", "立券", "交易", "安床", "安葬", "作灶", "入殓", "移柩", "冠笄", "成服", "除服", "破土", "合帐"],
    ji: ["开市", "词讼", "开光"]
  },
  "1-4": {
    yi: ["嫁娶", "出行", "移徙", "入宅", "裁衣", "安床", "安葬", "祭祀", "作灶", "破土"],
    ji: ["赴任", "捕捉"]
  },
  "1-40": {
    yi: ["嫁娶", "出行", "移徙", "造车器", "开厕", "祭祀", "作灶", "入殓", "冠笄", "补垣", "成服", "除服", "破土", "启鑽", "塞穴"],
    ji: ["入宅", "盖屋", "安葬", "安门", "上梁", "造桥"]
  },
  "1-41": {
    yi: ["嫁娶", "纳采", "裁衣", "动土", "安门", "修造", "造畜稠", "作灶", "起基", "冠笄", "伐木", "求嗣", "上梁", "竖柱", "筑堤", "作梁", "合帐"],
    ji: ["出行", "祈福", "栽种", "安葬"]
  },
  "1-42": {
    yi: ["安葬", "祭祀", "入殓", "移柩", "成服", "除服", "断蚁", "结网", "破土", "启鑽", "塞穴"],
    ji: ["嫁娶", "入宅", "开市", "盖屋", "开光"]
  },
  "1-43": {
    yi: ["嫁娶", "出行", "移徙", "动土", "祈福", "安床", "安葬", "祭祀", "修造", "拆卸", "入殓", "出火", "破土", "启鑽", "求嗣"],
    ji: ["理发", "盖屋", "作灶", "掘井", "开光", "造船"]
  },
  "1-44": {
    yi: ["出行", "移徙", "入宅", "动土", "沐浴", "安葬", "修造", "冠笄", "破土"],
    ji: ["嫁娶", "纳采", "开市", "祈福", "祭祀", "修坟", "斋醮"]
  },
  "1-45": {
    yi: ["解除", "扫舍", "整手足甲", "理发", "裁衣", "安床", "祭祀", "造畜稠", "作灶", "放水", "补垣", "塞穴", "筑堤"],
    ji: ["嫁娶", "会亲友", "栽种", "安门", "掘井", "开光"]
  },
  "1-46": {
    yi: ["理发", "置产", "安葬", "祭祀", "入殓", "移柩", "成服", "除服", "破土", "塞穴"],
    ji: ["嫁娶", "入宅", "安床", "掘井", "开光"]
  },
  "1-47": {
    yi: ["动土", "栽种", "开厕", "安门", "修造", "作灶", "补垣", "开池", "塞穴", "筑堤", "作梁"],
    ji: ["嫁娶", "祈福", "安床", "安葬", "行丧", "掘井"]
  },
  "1-48": {
    yi: ["立券", "交易", "纳财", "裁衣", "安床", "安葬", "造畜稠", "入殓", "修坟", "移柩", "成服", "除服", "立碑", "启鑽", "谢土"],
    ji: ["嫁娶", "开市", "动土", "开光", "破土"]
  },
  "1-49": {
    yi: ["裁衣", "经络", "安床", "安葬", "祭祀", "作灶", "入殓", "移柩", "伐木", "启鑽", "作梁", "合帐"],
    ji: ["入宅", "词讼", "出火"]
  },
  "1-5": {
    yi: ["嫁娶", "移徙", "纳财", "裁衣", "动土", "栽种", "安门", "修造", "拆卸", "冠笄", "出火", "伐木", "塞穴", "上梁", "筑堤", "合帐"],
    ji: ["出行", "祈福", "安床", "安葬", "行丧", "开光"]
  },
  "1-50": {
    yi: ["裁衣", "动土", "经络", "安葬", "修造", "拆卸", "合寿木", "入殓", "修坟", "移柩", "成服", "除服", "伐木", "合嵴", "开柱眼", "立碑", "破土", "启鑽"],
    ji: ["嫁娶", "出行", "祭祀", "掘井", "上梁"]
  },
  "1-51": {
    yi: ["立券", "交易", "裁衣", "安床", "安葬", "祭祀", "入殓", "冠笄", "补垣", "成服", "除服", "开池", "破土", "启鑽", "塞穴", "谢土"],
    ji: ["嫁娶", "开市", "栽种", "探病", "掘井", "开光"]
  },
  "1-52": {
    yi: [""],
    ji: ["馀事勿取"]
  },
  "1-53": {
    yi: ["动土", "栽种", "安床", "安门", "修造", "造畜稠", "起基", "补垣", "筑堤"],
    ji: ["嫁娶", "出行", "移徙", "理发", "入宅", "安葬", "行丧", "出火", "进人口", "掘井", "开光"]
  },
  "1-54": {
    yi: ["祭祀", "馀事勿取", "结网", "塞穴", "畋猎"],
    ji: ["嫁娶", "移徙", "入宅", "开市", "安门", "开光"]
  },
  "1-55": {
    yi: ["会亲友", "动土", "安葬", "祭祀", "入殓", "移柩", "开池", "破土", "塞穴", "筑堤"],
    ji: ["出行", "入宅", "裁衣", "安门", "修造", "作灶", "开光", "上梁"]
  },
  "1-56": {
    yi: ["嫁娶", "出行", "解除", "移徙", "入宅", "动土", "架马", "安葬", "修造", "合寿木", "开生坟", "入殓", "修坟", "移柩", "冠笄", "伐木", "开柱眼", "破土"],
    ji: ["开市", "祈福", "安床", "祭祀", "开光"]
  },
  "1-57": {
    yi: ["嫁娶", "扫舍", "整手足甲", "动土", "祈福", "安床", "安葬", "祭祀", "作灶", "入殓", "移柩", "补垣", "成服", "除服", "破土", "启鑽", "求嗣"],
    ji: ["栽种", "开光"]
  },
  "1-58": {
    yi: ["嫁娶", "会亲友", "纳采", "置产", "安床", "造畜稠", "冠笄", "捕捉", "塞穴"],
    ji: ["安葬", "修坟", "掘井", "开光", "谢土"]
  },
  "1-59": {
    yi: ["裁衣", "沐浴", "开厕", "修造", "冠笄", "安碓磑", "补垣", "断蚁", "开柱眼", "塞穴", "筑堤", "作梁"],
    ji: ["嫁娶", "移徙", "入宅", "祈福", "掘井", "开光"]
  },
  "1-6": {
    yi: ["安葬", "入殓", "移柩", "馀事勿取", "补垣", "成服", "除服", "结网", "启鑽", "塞穴"],
    ji: ["诸事不宜"]
  },
  "1-7": {
    yi: ["出行", "动土", "安床", "安葬", "祭祀", "修造", "造畜稠", "拆卸", "起基", "入殓", "移柩", "补垣", "出火", "破土", "塞穴", "作梁"],
    ji: ["嫁娶", "入宅", "掘井", "开光", "斋醮", "针灸"]
  },
  "1-8": {
    yi: ["嫁娶", "移徙", "入宅", "裁衣", "动土", "经络", "安机械", "安葬", "祭祀", "造仓", "拆卸", "起基", "入殓", "冠笄", "启鑽"],
    ji: ["交易", "开市", "安床", "开光"]
  },
  "1-9": {
    yi: ["嫁娶", "移徙", "裁衣", "安床", "安葬", "祭祀", "入殓", "移柩", "冠笄", "破土", "塞穴", "合帐"],
    ji: ["出行", "置产", "开市", "词讼", "栽种", "安门", "掘井", "开光"]
  },
  "10-0": {
    yi: ["解除", "立券", "交易", "开市", "祈福", "安床", "安葬", "挂匾", "祭祀", "修造", "开光", "求嗣"],
    ji: ["嫁娶", "纳采", "入宅", "订盟", "动土", "开仓", "纳畜", "问名", "出火", "伐木", "破土"]
  },
  "10-1": {
    yi: ["纳采", "开市", "动土", "祈福", "纳畜", "祭祀", "求医", "治病"],
    ji: ["嫁娶", "安葬"]
  },
  "10-10": {
    yi: ["取渔", "结网", "塞穴", "畋猎"],
    ji: ["嫁娶", "移徙", "入宅", "安葬", "安门"]
  },
  "10-11": {
    yi: ["出行", "移徙", "纳采", "立券", "入宅", "开市", "裁衣", "动土", "安床", "沐浴", "安门", "挂匾", "祭祀", "拆卸", "起基", "安香", "开光", "求嗣", "上梁", "竖柱", "塑绘"],
    ji: ["嫁娶", "栽种", "安葬", "伐木"]
  },
  "10-12": {
    yi: ["纳采", "出货财", "订盟", "祈福", "开仓", "盖屋", "安门", "祭祀", "起基", "入殓", "开光", "破土", "启鑽", "求嗣", "上梁", "竖柱", "谢土", "斋醮", "定磉"],
    ji: ["嫁娶", "开市", "出火"]
  },
  "10-13": {
    yi: ["立券", "交易", "开市", "动土", "祈福", "栽种", "安床", "安葬", "祭祀", "修造", "拆卸", "移柩", "伐木", "进人口", "开光", "破土"],
    ji: ["嫁娶", "出行", "移徙", "理发", "入宅", "出火"]
  },
  "10-14": {
    yi: ["纳采", "立券", "开市", "动土", "安机械", "安葬", "求医", "修造", "治病", "冠笄", "破土"],
    ji: ["嫁娶", "移徙", "入宅", "祭祀", "上梁", "斋醮"]
  },
  "10-15": {
    yi: ["嫁娶", "出行", "解除", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "栽种", "安床", "纳畜", "安葬", "挂匾", "修造", "拆卸", "入殓", "移柩", "进人口", "开光", "求嗣"],
    ji: [""]
  },
  "10-16": {
    yi: ["嫁娶", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "安床", "造车器", "祭祀", "修造", "治病", "安香", "捕捉", "结网", "开光", "普渡", "斋醮", "畋猎"],
    ji: ["纳采", "订盟", "经络", "安葬", "行丧", "探病"]
  },
  "10-17": {
    yi: ["立券", "交易", "入宅", "开市", "动土", "栽种", "安床", "挂匾", "祭祀", "修造", "拆卸", "出火", "进人口", "开光"],
    ji: ["嫁娶", "出行", "移徙", "纳畜", "安葬", "行丧", "伐木", "立碑"]
  },
  "10-18": {
    yi: ["嫁娶", "会亲友", "出行", "移徙", "纳采", "立券", "入宅", "开市", "订盟", "造车器", "安葬", "祭祀", "破土"],
    ji: ["盖屋", "架马", "合寿木", "开光", "上梁"]
  },
  "10-19": {
    yi: ["会亲友", "解除", "理发", "祈福", "栽种", "纳畜", "安葬", "祭祀", "牧养", "修坟", "开光", "立碑", "启鑽", "求嗣"],
    ji: ["出行", "移徙", "入宅", "赴任", "词讼", "作灶"]
  },
  "10-2": {
    yi: ["解除", "立券", "交易", "置产", "开市", "动土", "栽种", "安床", "安葬", "挂匾", "修造", "拆卸", "开光", "破土", "上梁"],
    ji: ["嫁娶", "入宅", "祭祀", "作灶", "出火"]
  },
  "10-20": {
    yi: ["会亲友", "出行", "解除", "移徙", "纳采", "入宅", "订盟", "祈福", "安机械", "纳畜", "盖屋", "安门", "祭祀", "牧养", "求医", "修造", "治病", "起基", "入殓", "修坟", "移柩", "安香", "出火", "开光", "立碑", "启鑽", "谢土", "造船", "斋醮", "针灸"],
    ji: ["嫁娶", "动土", "安床", "掘井", "造桥"]
  },
  "10-21": {
    yi: ["安葬", "祭祀", "入殓", "修坟", "成服", "除服", "立碑", "破土", "启鑽"],
    ji: ["馀事勿取"]
  },
  "10-22": {
    yi: ["安葬", "祭祀", "入殓", "移柩", "成服", "除服", "结网", "破土"],
    ji: ["馀事勿取"]
  },
  "10-23": {
    yi: ["移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "安床", "挂匾", "祭祀", "拆卸", "进人口", "开光", "上梁"],
    ji: ["嫁娶", "理发", "纳畜", "架马", "安葬", "牧养", "行丧", "伐木", "作梁"]
  },
  "10-24": {
    yi: ["纳采", "开市", "裁衣", "订盟", "动土", "经络", "安床", "安机械", "祭祀", "修造", "拆卸", "冠笄", "开光", "塑绘"],
    ji: ["入宅", "安葬", "出火", "伐木"]
  },
  "10-25": {
    yi: ["出行", "解除", "立券", "交易", "开市", "动土", "祈福", "栽种", "安床", "纳畜", "祭祀", "牧养", "开光", "破土", "上梁", "竖柱"],
    ji: ["嫁娶", "移徙", "入宅", "安葬", "掘井"]
  },
  "10-26": {
    yi: ["会亲友", "纳采", "开市", "订盟", "动土", "栽种", "纳畜", "安葬", "牧养", "修造", "拆卸", "起基", "入殓", "移柩", "成服", "除服", "雕刻", "进人口", "破土"],
    ji: [""]
  },
  "10-27": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "立券", "交易", "入宅", "开市", "订盟", "动土", "祈福", "栽种", "安床", "安葬", "挂匾", "祭祀", "修造", "拆卸", "入殓", "出火", "进人口", "开光", "破土", "求嗣", "谢土"],
    ji: ["纳畜", "合寿木", "伐木", "掘井"]
  },
  "10-28": {
    yi: ["解除", "纳采", "开市", "订盟", "动土", "祈福", "纳畜", "安葬", "牧养", "造仓", "放水", "开生坟", "起基", "入殓", "移柩", "成服", "除服", "破土", "求嗣"],
    ji: [""]
  },
  "10-29": {
    yi: ["立券", "交易", "纳财", "开市", "动土", "祈福", "栽种", "安床", "挂匾", "祭祀", "拆卸", "开光"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "词讼", "纳畜", "安葬", "出火", "进人口", "破土"]
  },
  "10-3": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "开市", "动土", "安葬", "破土", "上梁"],
    ji: ["赴任"]
  },
  "10-30": {
    yi: ["嫁娶", "会亲友", "出行", "移徙", "纳采", "立券", "交易", "入宅", "纳财", "开市", "赴任", "裁衣", "订盟", "经络", "祈福", "安床", "安葬", "祭祀", "修造", "拆卸", "入殓", "安香", "进人口", "开光", "启鑽", "上梁", "塑绘", "谢土", "斋醮"],
    ji: ["开仓", "冠笄", "伐木", "作梁"]
  },
  "10-31": {
    yi: ["解除", "祈福", "栽种", "纳畜", "安葬", "祭祀", "修造", "拆卸", "修坟", "伐木", "开光", "立碑", "求嗣"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "出火", "进人口"]
  },
  "10-32": {
    yi: ["出行", "解除", "移徙", "修造", "拆卸", "入殓", "修坟", "移柩", "成服", "除服", "立碑", "启鑽", "塑绘", "谢土", "造船", "斋醮"],
    ji: [""]
  },
  "10-33": {
    yi: ["安葬", "祭祀", "入殓", "修坟", "成服", "除服", "立碑", "破土", "启鑽", "斋醮"],
    ji: ["嫁娶", "纳采", "入宅", "订盟", "作灶"]
  },
  "10-34": {
    yi: ["安葬", "取渔", "入殓", "移柩", "成服", "除服", "立碑", "破土"],
    ji: ["嫁娶", "入宅", "作灶", "上梁"]
  },
  "10-35": {
    yi: ["解除", "理发", "经络", "祈福", "栽种", "沐浴", "祭祀", "牧养", "治病", "掘井", "开池", "开光", "立碑", "求嗣", "斋醮"],
    ji: ["嫁娶", "安葬", "合寿木", "行丧", "定磉"]
  },
  "10-36": {
    yi: [""],
    ji: ["诸事不宜"]
  },
  "10-37": {
    yi: ["解除", "纳采", "立券", "交易", "纳财", "开市", "订盟", "动土", "祈福", "栽种", "纳畜", "安葬", "祭祀", "造仓", "起基", "进人口", "开池", "开光", "破土", "求嗣"],
    ji: ["嫁娶", "入宅", "裁衣", "安床", "上梁"]
  },
  "10-38": {
    yi: ["动土", "安葬", "求医", "治病", "入殓", "破土", "上梁"],
    ji: ["嫁娶", "开光"]
  },
  "10-39": {
    yi: ["嫁娶", "会亲友", "纳采", "订盟", "祈福", "盖屋", "安葬", "安门", "祭祀", "求医", "治病", "起基", "安碓磑", "成服", "除服", "开池", "开光", "破土", "上梁", "竖柱", "斋醮", "筑堤"],
    ji: ["入宅", "开市", "词讼", "合寿木", "掘井"]
  },
  "10-4": {
    yi: ["出行", "移徙", "纳采", "立券", "交易", "开市", "订盟", "动土", "祈福", "栽种", "安床", "安机械", "纳畜", "安葬", "祭祀", "修造", "拆卸", "移柩", "出火", "进人口", "开光", "破土", "普渡", "求嗣", "上梁"],
    ji: ["嫁娶", "入宅", "牧养", "掘井"]
  },
  "10-40": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "安葬", "祭祀", "求医", "治病", "破土"],
    ji: ["开光", "针灸"]
  },
  "10-41": {
    yi: ["嫁娶", "解除", "移徙", "纳采", "立券", "交易", "入宅", "开市", "订盟", "祈福", "安床", "挂匾", "祭祀", "出火", "进人口", "开光", "求嗣"],
    ji: ["出行", "栽种", "纳畜", "安葬", "行丧", "伐木", "造庙", "造桥"]
  },
  "10-42": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "开市", "订盟", "动土", "祈福", "安葬", "祭祀", "破土"],
    ji: ["安门", "斋醮"]
  },
  "10-43": {
    yi: ["会亲友", "纳采", "订盟", "动土", "祈福", "安机械", "安葬", "祭祀", "修造", "破土"],
    ji: ["嫁娶", "移徙", "入宅", "开市", "出火"]
  },
  "10-44": {
    yi: ["解除", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "10-45": {
    yi: ["解除", "沐浴", "祭祀", "馀事勿取", "补垣", "断蚁", "塞穴"],
    ji: ["嫁娶", "入宅", "安葬", "修造", "行丧", "造庙"]
  },
  "10-46": {
    yi: ["安葬", "入殓", "移柩", "成服", "除服", "结网", "破土"],
    ji: ["诸事不宜"]
  },
  "10-47": {
    yi: ["出行", "移徙", "纳采", "立券", "交易", "纳财", "开市", "动土", "修造", "拆卸", "起基", "冠笄", "出火", "开光", "求嗣", "上梁", "造船"],
    ji: ["嫁娶", "祈福", "安葬", "破土"]
  },
  "10-48": {
    yi: ["解除", "纳采", "动土", "祈福", "安床", "安葬", "祭祀", "拆卸", "入殓", "移柩", "冠笄", "出火", "进人口", "掘井", "开池", "开光", "破土", "求嗣", "上梁", "造庙"],
    ji: [""]
  },
  "10-49": {
    yi: ["会亲友", "立券", "交易", "开市", "动土", "栽种", "安机械", "盖屋", "开厕", "安葬", "安门", "牧养", "求医", "修造", "造畜稠", "治病", "作灶", "放水", "起基", "开池", "开光", "立碑", "破土", "上梁", "竖柱", "定磉"],
    ji: ["嫁娶", "移徙", "入宅", "出火"]
  },
  "10-5": {
    yi: ["会亲友", "立券", "开市", "赴任", "动土", "经络", "安床", "祭祀", "拆卸", "起基", "冠笄", "进人口", "开光", "上梁", "塑绘"],
    ji: ["安葬", "定磉"]
  },
  "10-50": {
    yi: ["立券", "交易", "纳财", "开市", "动土", "栽种", "安床", "安葬", "修造", "拆卸", "入殓", "成服", "除服", "破土", "上梁"],
    ji: ["嫁娶", "移徙", "入宅", "纳畜", "祭祀", "探病", "出火", "伐木"]
  },
  "10-51": {
    yi: ["出行", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "安机械", "安葬", "祭祀", "修造", "拆卸", "起基", "入殓", "移柩", "成服", "出火", "除服", "破土", "谢土", "造庙", "斋醮"],
    ji: ["嫁娶", "开市", "栽种", "合寿木"]
  },
  "10-52": {
    yi: ["嫁娶", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "安床", "纳畜", "安葬", "祭祀", "拆卸", "入殓", "出火", "伐木", "开光"],
    ji: ["出行", "栽种", "作灶", "针灸"]
  },
  "10-53": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "开市", "订盟", "动土", "纳畜", "挂匾", "牧养", "修造", "造仓", "拆卸", "放水", "起基", "出火", "雕刻", "开池", "开光", "求嗣", "上梁", "造船"],
    ji: ["安葬", "合寿木", "行丧"]
  },
  "10-54": {
    yi: ["嫁娶", "出行", "移徙", "入宅", "开市", "安床", "祭祀", "修造", "拆卸", "出火", "开光"],
    ji: ["置产", "纳畜", "安葬", "修坟", "行丧", "伐木", "立碑", "作梁"]
  },
  "10-55": {
    yi: ["会亲友", "解除", "入学", "纳采", "立券", "交易", "纳财", "订盟", "动土", "经络", "祈福", "栽种", "纳畜", "安葬", "祭祀", "牧养", "起基", "入殓", "开池", "开光", "立碑", "破土", "求嗣", "斋醮", "定磉"],
    ji: ["嫁娶", "移徙", "入宅", "开市", "出火"]
  },
  "10-56": {
    yi: ["解除", "扫舍", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "10-57": {
    yi: ["安葬", "入殓", "修坟", "移柩", "成服", "除服", "立碑", "启鑽"],
    ji: ["嫁娶", "开市", "伐木", "作梁"]
  },
  "10-58": {
    yi: ["安葬", "祭祀", "移柩", "馀事勿取", "成服", "除服", "结网", "破土", "塞穴", "谢土"],
    ji: ["嫁娶", "入宅"]
  },
  "10-59": {
    yi: ["纳采", "立券", "入宅", "纳财", "开市", "订盟", "动土", "沐浴", "安门", "祭祀", "拆卸", "起基", "冠笄", "安香", "出火", "开光", "求嗣", "上梁", "竖柱", "塑绘", "合帐"],
    ji: ["嫁娶", "安葬", "伐木", "造庙"]
  },
  "10-6": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "立券", "交易", "入宅", "开市", "订盟", "动土", "祈福", "栽种", "安床", "造车器", "安葬", "安门", "挂匾", "祭祀", "修造", "拆卸", "入殓", "成服", "除服", "开光", "立碑", "破土", "启鑽"],
    ji: ["纳畜", "盖屋", "起基", "探病", "伐木", "作梁"]
  },
  "10-7": {
    yi: ["会亲友", "纳采", "立券", "交易", "纳财", "开市", "裁衣", "订盟", "经络", "祈福", "安床", "安机械", "纳畜", "安葬", "祭祀", "造畜稠", "入殓", "移柩", "冠笄", "成服", "除服", "启鑽", "上梁", "竖柱", "谢土", "筑堤", "合帐"],
    ji: ["嫁娶", "入宅", "赴任", "治病"]
  },
  "10-8": {
    yi: ["嫁娶", "出行", "解除", "移徙", "入宅", "祈福", "纳畜", "祭祀", "入殓", "修坟", "开光", "立碑", "求嗣"],
    ji: ["动土", "栽种", "安床", "伐木", "破土", "造桥", "作梁"]
  },
  "10-9": {
    yi: ["安葬", "入殓", "移柩", "馀事勿取", "成服", "除服", "立碑", "启鑽"],
    ji: ["伐木", "破土"]
  },
  "11-0": {
    yi: ["栽种", "沐浴", "祭祀", "捕捉"],
    ji: ["嫁娶", "移徙", "入宅", "安葬", "作灶"]
  },
  "11-1": {
    yi: ["纳财", "纳畜", "安门", "祭祀", "取渔", "馀事勿取"],
    ji: ["嫁娶", "入宅"]
  },
  "11-10": {
    yi: ["嫁娶", "纳财", "祈福", "祭祀", "作灶", "入殓", "捕捉", "成服", "除服", "开光", "塑绘", "斋醮", "畋猎"],
    ji: ["安床", "开仓", "盖屋", "安葬"]
  },
  "11-11": {
    yi: ["会亲友", "出行", "移徙", "纳采", "入宅", "动土", "祈福", "祭祀", "修造"],
    ji: ["嫁娶", "开市", "安葬", "破土"]
  },
  "11-12": {
    yi: ["嫁娶", "纳财", "裁衣", "安床", "入殓", "冠笄", "纳婿", "合帐"],
    ji: ["开市", "安葬", "作灶", "作梁"]
  },
  "11-13": {
    yi: ["解除", "祭祀", "馀事勿取", "捕捉"],
    ji: ["嫁娶", "安葬"]
  },
  "11-14": {
    yi: ["解除", "馀事勿取", "结网"],
    ji: ["诸事不宜"]
  },
  "11-15": {
    yi: ["祭祀", "作灶", "馀事勿取"],
    ji: ["开市", "安葬", "修坟", "掘井", "破土"]
  },
  "11-16": {
    yi: ["纳财", "栽种", "纳畜", "祭祀", "作灶", "进人口"],
    ji: ["开市", "经络", "安床", "安葬", "修坟", "立碑", "破土", "启鑽"]
  },
  "11-17": {
    yi: ["嫁娶", "会亲友", "纳采", "立券", "纳财", "开市", "裁衣", "订盟", "安床", "安机械", "纳畜", "牧养", "作灶", "冠笄"],
    ji: ["出行", "安葬", "行丧", "掘井", "破土"]
  },
  "11-18": {
    yi: ["嫁娶", "会亲友", "理发", "祭祀", "入殓", "移柩", "进人口", "针灸"],
    ji: ["入宅", "安葬", "作灶", "探病", "伐木", "开渠"]
  },
  "11-19": {
    yi: ["纳财", "祭祀", "作灶", "馀事勿取", "捕捉", "畋猎"],
    ji: ["开市", "动土", "安葬", "破土"]
  },
  "11-2": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅"],
    ji: ["动土", "安葬", "破土"]
  },
  "11-20": {
    yi: ["沐浴", "祭祀", "入殓", "移柩", "成服", "除服", "结网"],
    ji: ["嫁娶", "交易", "开市", "出货财", "安床", "安葬", "作灶", "修坟"]
  },
  "11-21": {
    yi: ["扫舍", "纳财", "安床", "沐浴", "祭祀", "作灶", "捕捉", "畋猎"],
    ji: ["开市", "安葬", "破土", "斋醮"]
  },
  "11-22": {
    yi: ["解除", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "11-23": {
    yi: ["移徙", "纳采", "裁衣", "订盟", "动土", "祈福", "安床", "纳畜", "安门", "修造", "造仓", "拆卸", "起基", "冠笄", "结网", "开光", "求嗣", "塑绘"],
    ji: ["入宅", "安葬", "取渔", "作灶", "伐木"]
  },
  "11-24": {
    yi: ["嫁娶", "理发", "冠笄", "进人口"],
    ji: ["置产", "纳畜", "安葬", "造畜稠", "作灶", "开生坟", "伐木", "破土", "作梁"]
  },
  "11-25": {
    yi: ["祭祀"],
    ji: ["嫁娶", "安床", "馀事勿取", "造庙"]
  },
  "11-26": {
    yi: ["出行", "解除", "移徙", "纳采", "入宅", "纳畜", "牧养", "作灶", "冠笄", "进人口", "上梁", "竖柱"],
    ji: ["动土", "安床", "架马", "安葬", "祭祀", "修造", "修坟", "伐木", "破土"]
  },
  "11-27": {
    yi: ["修饰垣墙", "祭祀", "取渔", "馀事勿取", "捕捉"],
    ji: ["诸事不宜"]
  },
  "11-28": {
    yi: ["交易", "纳财", "栽种", "纳畜", "祭祀", "牧养", "作灶", "冠笄", "结网", "进人口"],
    ji: ["出行", "开市", "安床", "安葬", "开生坟", "修坟", "掘井", "开渠", "破土", "造船"]
  },
  "11-29": {
    yi: ["嫁娶", "解除", "移徙", "纳采", "立券", "交易", "入宅", "纳财", "开市", "订盟", "动土", "纳畜", "安门", "分居", "牧养", "修造", "拆卸", "起基", "出火", "开光", "塑绘"],
    ji: [""]
  },
  "11-3": {
    yi: ["祭祀", "馀事勿取", "结网"],
    ji: ["出行", "入宅", "安葬", "掘井"]
  },
  "11-30": {
    yi: ["嫁娶", "会亲友", "理发", "祭祀", "作灶", "移柩", "冠笄", "进人口"],
    ji: ["开市", "出货财", "栽种", "开仓", "纳畜", "盖屋", "伐木", "破土", "启鑽", "上梁"]
  },
  "11-31": {
    yi: ["祭祀", "作灶", "入殓", "成服", "除服", "畋猎"],
    ji: ["开市", "动土", "栽种", "安葬"]
  },
  "11-32": {
    yi: ["解除", "扫舍", "沐浴", "馀事勿取", "捕捉", "塞穴", "畋猎"],
    ji: ["嫁娶", "入宅", "开市", "安床", "修坟", "破土"]
  },
  "11-33": {
    yi: ["纳财", "安床", "沐浴", "祭祀", "捕捉", "畋猎"],
    ji: ["开市", "破土"]
  },
  "11-34": {
    yi: ["纳财", "祭祀", "捕捉", "斋醮", "畋猎"],
    ji: ["嫁娶", "入宅", "开市", "安床", "安葬", "破土"]
  },
  "11-35": {
    yi: ["纳采", "立券", "交易", "纳财", "开市", "裁衣", "订盟", "经络", "安床", "安机械", "沐浴", "纳畜", "祭祀", "取渔", "造仓", "冠笄", "捕捉", "酬神", "结网", "开池", "求嗣", "合帐"],
    ji: ["安葬", "作灶", "伐木", "作梁"]
  },
  "11-36": {
    yi: ["理发", "立券", "交易", "纳财", "栽种", "取渔", "捕捉", "教牛马", "结网", "进人口"],
    ji: ["入宅", "盖屋", "安葬", "竖柱"]
  },
  "11-37": {
    yi: ["解除", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "11-38": {
    yi: ["祭祀", "馀事勿取", "捕捉", "结网"],
    ji: ["嫁娶", "开市", "探病"]
  },
  "11-39": {
    yi: ["栽种", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "11-4": {
    yi: ["纳财", "祭祀", "作灶", "捕捉"],
    ji: ["开市", "破土"]
  },
  "11-40": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "移徙", "入学", "纳采", "入宅", "订盟", "祈福", "栽种", "纳畜", "盖屋", "祭祀", "牧养", "拆卸", "起基", "安香", "出火", "开光", "上梁", "竖柱", "塑绘", "斋醮"],
    ji: ["开市", "出货财", "开仓", "安葬", "破土", "启鑽"]
  },
  "11-41": {
    yi: ["纳采", "订盟", "祈福", "安机械", "纳畜", "祭祀", "作灶"],
    ji: ["动土", "安葬"]
  },
  "11-42": {
    yi: ["祭祀", "冠笄", "馀事勿取", "捕捉"],
    ji: ["嫁娶", "开市", "盖屋", "合寿木", "作梁"]
  },
  "11-43": {
    yi: ["祭祀", "馀事勿取", "塞穴"],
    ji: ["诸事不宜"]
  },
  "11-44": {
    yi: ["扫舍", "沐浴", "祭祀", "捕捉", "结网", "畋猎"],
    ji: ["嫁娶", "纳采", "订盟", "动土", "安床", "安葬", "破土"]
  },
  "11-45": {
    yi: ["扫舍", "理发", "沐浴"],
    ji: ["嫁娶", "入宅", "纳畜", "安葬", "安门", "造畜稠", "作灶", "伐木", "上梁", "造船", "作梁"]
  },
  "11-46": {
    yi: ["嫁娶", "会亲友", "纳采", "纳财", "裁衣", "订盟", "祭祀", "作灶", "冠笄", "问名", "捕捉", "进人口"],
    ji: ["开市", "安床", "安葬", "修坟"]
  },
  "11-47": {
    yi: ["出行", "解除", "移徙", "雇庸", "动土", "祈福", "安床", "安门", "祭祀", "起基", "进人口", "开光", "上梁"],
    ji: ["嫁娶", "纳畜", "安葬", "牧养", "作灶", "行丧", "破土", "作梁"]
  },
  "11-48": {
    yi: ["嫁娶", "理发", "栽种", "冠笄", "捕捉", "进人口", "针灸"],
    ji: ["纳财", "开市", "安葬", "破土"]
  },
  "11-49": {
    yi: ["解除", "破屋", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "11-5": {
    yi: ["嫁娶", "会亲友", "移徙", "立券", "交易", "裁衣", "动土", "经络", "祈福", "栽种", "安床", "祭祀", "修造", "冠笄", "进人口", "求嗣", "上梁", "竖柱"],
    ji: ["出行", "纳畜", "安葬", "行丧", "伐木", "造桥", "作梁"]
  },
  "11-50": {
    yi: ["栽种", "馀事勿取", "捕捉", "畋猎"],
    ji: ["开市", "动土", "安葬", "祭祀", "探病", "斋醮"]
  },
  "11-51": {
    yi: ["祭祀", "作灶", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "11-52": {
    yi: ["纳财", "纳畜", "祭祀", "牧养", "馀事勿取", "捕捉", "进人口"],
    ji: ["入宅", "开市", "动土", "安床", "安葬"]
  },
  "11-53": {
    yi: ["解除", "立券", "交易", "纳财", "纳畜", "祭祀", "进人口", "开光"],
    ji: ["嫁娶", "出行", "移徙", "理发", "入宅", "动土", "分居", "安香", "出火", "破土"]
  },
  "11-54": {
    yi: ["嫁娶", "祭祀", "捕捉"],
    ji: ["入宅", "开市", "动土", "安门", "修造", "开光", "破土"]
  },
  "11-55": {
    yi: ["嫁娶", "纳财", "祭祀", "作灶"],
    ji: ["开市", "安葬", "修坟", "立碑"]
  },
  "11-56": {
    yi: ["会亲友", "解除", "入殓", "移柩", "馀事勿取", "捕捉", "成服", "除服", "畋猎"],
    ji: ["安床", "安葬", "安门", "修坟", "破土"]
  },
  "11-57": {
    yi: ["扫舍", "整手足甲", "理发", "安床", "祭祀", "作灶", "教牛马", "开光"],
    ji: ["嫁娶", "交易", "开市", "动土", "纳畜", "安葬", "开生坟", "伐木", "破土", "作梁"]
  },
  "11-58": {
    yi: ["祭祀", "作灶", "入殓", "馀事勿取", "除服"],
    ji: ["开市", "安床"]
  },
  "11-59": {
    yi: ["理发", "栽种", "沐浴", "祭祀", "作灶", "结网"],
    ji: ["嫁娶", "开市", "词讼", "纳畜", "安葬", "牧养", "造畜稠", "行丧", "伐木", "作梁"]
  },
  "11-6": {
    yi: ["嫁娶", "会亲友", "裁衣", "祭祀", "入殓", "移柩", "冠笄", "捕捉", "成服", "除服", "进人口", "纳婿"],
    ji: ["移徙", "入宅", "作灶"]
  },
  "11-7": {
    yi: ["会亲友", "移徙", "理发", "纳财", "祭祀", "冠笄", "捕捉"],
    ji: ["嫁娶", "开市", "开厕", "开池", "破土"]
  },
  "11-8": {
    yi: ["扫舍", "沐浴", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "11-9": {
    yi: ["扫舍", "理发", "纳财", "栽种", "沐浴", "祭祀", "捕捉", "结网", "进人口", "畋猎"],
    ji: ["会亲友", "移徙", "入宅", "开市", "安床", "安葬", "安门", "作灶", "行丧", "出火"]
  },
  "2-0": {
    yi: ["交易", "沐浴", "安葬", "祭祀", "入殓", "修坟", "捕捉", "成服", "除服", "进人口", "启鑽", "谢土"],
    ji: ["入宅", "动土", "修造", "破土", "斋醮"]
  },
  "2-1": {
    yi: ["解除", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "2-10": {
    yi: ["出行", "安床", "造车器", "盖屋", "安门", "祭祀", "修造", "造畜稠", "教牛马", "上梁"],
    ji: ["出货财", "动土", "栽种", "开仓", "安葬", "行丧", "伐木", "开渠", "破土"]
  },
  "2-11": {
    yi: ["出行", "沐浴", "祭祀", "冠笄", "馀事勿取", "进人口"],
    ji: ["嫁娶", "动土", "安葬", "作灶"]
  },
  "2-12": {
    yi: ["造畜稠", "教牛马"],
    ji: ["嫁娶", "扫舍", "移徙", "入宅", "动土", "分居", "作灶", "安香", "出火", "掘井", "造桥"]
  },
  "2-13": {
    yi: ["解除", "扫舍", "祭祀", "教牛马"],
    ji: ["馀事勿取"]
  },
  "2-14": {
    yi: ["会亲友", "纳采", "立券", "安葬", "入殓", "移柩", "启鑽", "上梁", "竖柱"],
    ji: ["移徙", "入宅", "动土", "祭祀", "破土"]
  },
  "2-15": {
    yi: ["嫁娶", "出行", "安床", "安葬", "祭祀", "入殓", "移柩", "冠笄"],
    ji: ["动土", "栽种", "作灶", "掘井"]
  },
  "2-16": {
    yi: ["出行", "解除", "祭祀", "馀事勿取", "教牛马"],
    ji: ["动土", "安葬", "行丧", "探病", "开光", "破土", "作梁"]
  },
  "2-17": {
    yi: ["解除", "扫舍", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "2-18": {
    yi: ["交易", "纳财", "祭祀"],
    ji: ["动土", "开渠", "破土", "上梁", "斋醮"]
  },
  "2-19": {
    yi: ["出行", "交易", "祭祀", "造畜稠", "割蜜"],
    ji: ["嫁娶", "移徙", "动土", "词讼", "安葬", "作灶", "伐木", "掘井", "破土", "作梁"]
  },
  "2-2": {
    yi: ["解除", "立券", "交易", "纳畜", "安葬", "入殓", "移柩", "伐木", "开光", "上梁", "竖柱"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "动土", "祭祀", "作灶", "破土"]
  },
  "2-20": {
    yi: ["嫁娶", "出行", "扫舍", "纳财", "赴任", "沐浴", "纳畜", "祭祀", "冠笄", "普渡"],
    ji: ["开市", "动土", "安床", "开仓", "破土", "上梁"]
  },
  "2-21": {
    yi: ["出行", "扫舍", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "2-22": {
    yi: ["嫁娶", "会亲友", "移徙", "纳采", "立券", "交易", "置产", "开市", "订盟", "祈福", "纳畜", "盖屋", "安门", "祭祀", "求医", "治病", "放水", "捕捉", "合嵴", "求嗣", "上梁", "竖柱"],
    ji: ["动土", "安葬", "破土", "造船", "造庙"]
  },
  "2-23": {
    yi: ["沐浴", "祭祀"],
    ji: ["馀事勿取"]
  },
  "2-24": {
    yi: ["裁衣", "馀事勿取", "教牛马", "合帐"],
    ji: ["嫁娶", "入宅", "动土", "作灶", "破土", "造船"]
  },
  "2-25": {
    yi: ["解除", "祭祀", "造畜稠", "馀事勿取", "教牛马", "针灸"],
    ji: ["嫁娶", "动土", "安葬", "开池"]
  },
  "2-26": {
    yi: ["会亲友", "纳财", "裁衣", "入殓", "成服", "除服", "合帐"],
    ji: ["嫁娶", "移徙", "入宅", "祈福", "祭祀"]
  },
  "2-27": {
    yi: ["嫁娶", "会亲友", "出行", "交易", "开市", "安葬", "祭祀", "移柩", "冠笄", "成服", "除服", "教牛马", "启鑽", "求嗣", "斋醮"],
    ji: ["移徙", "入宅", "动土", "祈福"]
  },
  "2-28": {
    yi: ["嫁娶", "出行", "解除", "扫舍", "裁衣", "安床", "祭祀", "冠笄", "进人口"],
    ji: ["动土", "安葬", "掘井", "开光", "破土"]
  },
  "2-29": {
    yi: ["馀事勿取", "断蚁", "结网", "塞穴", "畋猎"],
    ji: ["嫁娶", "出行", "入宅", "动土", "词讼", "安葬"]
  },
  "2-3": {
    yi: ["会亲友", "出行", "纳采", "立券", "交易", "开市", "赴任", "裁衣", "订盟", "祈福", "安床", "安葬", "入殓", "移柩", "成服", "酬神", "除服", "开光", "立碑", "启鑽", "竖柱", "塑绘"],
    ji: ["动土", "栽种", "作灶", "掘井"]
  },
  "2-30": {
    yi: ["安葬", "祭祀", "入殓", "移柩", "启鑽"],
    ji: ["动土", "破土", "上梁"]
  },
  "2-31": {
    yi: ["嫁娶", "出行", "交易", "纳财", "裁衣", "造车器", "祭祀", "造畜稠", "冠笄", "雕刻", "教牛马"],
    ji: ["移徙", "入宅", "动土", "栽种", "安葬", "作灶", "行丧", "伐木", "破土", "上梁"]
  },
  "2-32": {
    yi: ["嫁娶", "出行", "纳畜", "安葬", "祭祀", "入殓", "启鑽"],
    ji: ["动土", "作灶", "破土"]
  },
  "2-33": {
    yi: ["出行", "扫舍", "沐浴", "安葬", "祭祀", "馀事勿取"],
    ji: ["置产", "动土", "掘井", "破土"]
  },
  "2-34": {
    yi: ["造畜稠", "作灶"],
    ji: ["安葬", "行丧"]
  },
  "2-35": {
    yi: ["出行", "解除", "修饰垣墙", "冠笄", "馀事勿取"],
    ji: ["嫁娶", "开市", "动土", "安葬", "破土"]
  },
  "2-36": {
    yi: ["教牛马"],
    ji: ["入宅", "动土", "馀事勿取", "破土"]
  },
  "2-37": {
    yi: ["会亲友", "解除", "祭祀", "造畜稠", "馀事勿取", "教牛马"],
    ji: ["嫁娶", "出行", "入宅", "动土", "安葬", "行丧", "破土"]
  },
  "2-38": {
    yi: ["解除", "立券", "交易", "纳财", "裁衣", "安床", "纳畜", "安葬", "牧养", "入殓", "移柩", "启鑽", "上梁", "竖柱"],
    ji: ["嫁娶", "出行", "入宅", "动土", "祭祀", "掘井", "开渠"]
  },
  "2-39": {
    yi: ["会亲友", "出行", "立券", "交易", "纳财", "祭祀", "冠笄"],
    ji: ["嫁娶", "动土", "起基", "掘井", "破土", "定磉"]
  },
  "2-4": {
    yi: ["修饰垣墙", "祭祀", "馀事勿取"],
    ji: ["动土", "修造", "开光", "破土"]
  },
  "2-40": {
    yi: ["出行", "修饰垣墙", "造畜稠", "馀事勿取", "教牛马"],
    ji: ["诸事不宜"]
  },
  "2-41": {
    yi: ["会亲友", "解除", "祭祀", "馀事勿取", "断蚁"],
    ji: ["嫁娶", "安葬"]
  },
  "2-42": {
    yi: ["解除", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "2-43": {
    yi: ["出行", "造车器", "盖屋", "祭祀", "修造", "造畜稠", "割蜜", "教牛马", "竖柱"],
    ji: ["动土", "安葬", "掘井", "破土"]
  },
  "2-44": {
    yi: ["出行", "解除", "移徙", "纳财", "祈福", "纳畜", "盖屋", "安葬", "安门", "祭祀", "牧养", "入殓", "开光", "启鑽", "求嗣", "上梁"],
    ji: ["置产", "动土", "安床", "掘井", "破土"]
  },
  "2-45": {
    yi: ["出行", "祭祀"],
    ji: ["嫁娶", "会亲友", "入宅", "动土", "修造", "破土"]
  },
  "2-46": {
    yi: ["嫁娶", "会亲友", "出行", "移徙", "纳财", "裁衣", "纳畜", "祭祀", "造畜稠", "冠笄", "上梁", "竖柱"],
    ji: ["动土", "安葬", "开生坟", "行丧", "伐木", "作梁"]
  },
  "2-47": {
    yi: ["出行", "沐浴", "祭祀", "馀事勿取"],
    ji: ["开市", "动土", "安葬", "行丧", "破土"]
  },
  "2-48": {
    yi: ["安葬", "入殓", "移柩", "成服", "除服", "启鑽"],
    ji: ["馀事勿取"]
  },
  "2-49": {
    yi: ["会亲友", "解除", "祭祀", "馀事勿取", "教牛马"],
    ji: ["动土", "安葬", "破土"]
  },
  "2-5": {
    yi: ["馀事勿取", "结网", "塞穴"],
    ji: ["诸事不宜"]
  },
  "2-50": {
    yi: ["立券", "交易", "纳财", "裁衣", "伐木", "作梁"],
    ji: ["诸事不宜"]
  },
  "2-51": {
    yi: ["嫁娶", "会亲友", "立券", "交易", "裁衣", "祭祀", "冠笄", "进人口", "合帐"],
    ji: ["动土", "栽种", "安葬", "修坟", "探病", "掘井"]
  },
  "2-52": {
    yi: ["出行", "扫舍", "祭祀", "馀事勿取", "教牛马"],
    ji: ["安葬", "伐木", "开光", "破土"]
  },
  "2-53": {
    yi: ["馀事勿取", "断蚁", "结网", "塞穴"],
    ji: ["安葬", "破土"]
  },
  "2-54": {
    yi: ["祭祀", "馀事勿取", "断蚁", "教牛马"],
    ji: ["移徙", "入宅", "动土", "斋醮"]
  },
  "2-55": {
    yi: ["会亲友", "纳财", "开市", "裁衣", "经络", "开仓", "安机械", "纳畜", "祭祀", "牧养", "造畜稠", "冠笄", "教牛马", "塑绘"],
    ji: ["动土", "安葬", "治病", "破土"]
  },
  "2-56": {
    yi: ["出行", "扫舍", "纳财", "裁衣", "纳畜", "安门", "祭祀", "造畜稠", "作灶", "进人口"],
    ji: ["动土", "安床", "安葬", "合寿木", "开生坟"]
  },
  "2-57": {
    yi: ["出行", "扫舍", "交易", "祈福", "沐浴", "祭祀", "教牛马", "求嗣"],
    ji: ["动土", "安葬", "作灶", "修坟", "行丧"]
  },
  "2-58": {
    yi: ["出行", "解除", "移徙", "入宅", "纳财", "祈福", "安床", "纳畜", "安门", "祭祀", "造畜稠", "开光", "求嗣", "上梁"],
    ji: ["嫁娶", "安葬", "行丧", "伐木", "开渠", "破土"]
  },
  "2-59": {
    yi: ["沐浴", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "2-6": {
    yi: ["出行", "馀事勿取", "割蜜", "教牛马"],
    ji: ["动土", "盖屋", "破土", "斋醮"]
  },
  "2-7": {
    yi: ["嫁娶", "出行", "解除", "移徙", "纳采", "入宅", "祈福", "祭祀"],
    ji: ["动土", "安葬"]
  },
  "2-8": {
    yi: ["嫁娶", "出行", "解除", "移徙", "纳采", "入宅", "纳财", "订盟", "祈福", "纳畜", "安葬", "祭祀", "入殓", "启鑽", "求嗣", "上梁", "竖柱"],
    ji: ["置产", "动土", "栽种", "安床", "掘井", "破土"]
  },
  "2-9": {
    yi: ["出行", "沐浴", "祭祀", "入殓", "成服", "除服"],
    ji: ["移徙", "入宅", "开市", "动土", "冠笄", "上梁", "竖柱"]
  },
  "3-0": {
    yi: ["嫁娶", "会亲友", "出行", "扫舍", "纳采", "纳财", "赴任", "裁衣", "订盟", "动土", "祈福", "栽种", "沐浴", "纳畜", "祭祀", "修造", "入殓", "移柩", "成服", "除服", "伐木", "开光", "启鑽", "上梁", "竖柱", "塑绘"],
    ji: ["入宅", "安床", "开仓", "作灶"]
  },
  "3-1": {
    yi: ["嫁娶", "出行", "入学", "纳采", "立券", "交易", "入宅", "订盟", "动土", "祈福", "造车器", "盖屋", "归宁", "安门", "祭祀", "求医", "修造", "治病", "起基", "安香", "出火", "上梁", "竖柱", "造庙"],
    ji: ["安葬", "行丧", "伐木", "斋醮", "作梁"]
  },
  "3-10": {
    yi: ["出行", "赴任", "沐浴", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "3-11": {
    yi: ["出行", "解除", "扫舍", "移徙", "入宅", "安床", "祭祀", "修造", "造畜稠", "拆卸", "出火", "伐木", "开光", "作梁"],
    ji: ["嫁娶", "动土", "栽种", "作灶", "掘井", "造庙", "造桥"]
  },
  "3-12": {
    yi: ["嫁娶", "移徙", "整手足甲", "理发", "入学", "纳采", "入宅", "赴任", "裁衣", "订盟", "祈福", "沐浴", "安葬", "祭祀", "治病", "拆卸", "入殓", "修坟", "移柩", "冠笄", "安香", "开光", "破土", "启鑽", "塑绘", "谢土", "斋醮", "作梁"],
    ji: ["开市"]
  },
  "3-13": {
    yi: ["会亲友", "出行", "移徙", "纳采", "立券", "交易", "入宅", "开市", "订盟", "动土", "祈福", "栽种", "安床", "安机械", "纳畜", "造车器", "盖屋", "祭祀", "修造", "造畜稠", "起基", "安香", "上梁"],
    ji: ["安葬", "开生坟", "行丧", "破土"]
  },
  "3-14": {
    yi: ["解除", "移徙", "立券", "交易", "入宅", "开市", "动土", "栽种", "安床", "纳畜", "安葬", "挂匾", "拆卸", "出火", "伐木", "开光", "上梁", "作梁"],
    ji: ["嫁娶", "出行", "置产", "祭祀"]
  },
  "3-15": {
    yi: ["出行", "移徙", "立券", "入宅", "开市", "动土", "祈福", "安葬", "祭祀", "破土", "斋醮"],
    ji: ["嫁娶", "纳畜", "作灶", "掘井", "开光"]
  },
  "3-16": {
    yi: ["塞穴"],
    ji: ["嫁娶", "安葬", "安门", "作灶"]
  },
  "3-17": {
    yi: ["会亲友", "解除", "扫舍", "理发", "栽种", "沐浴", "求医", "造畜稠", "治病", "斋醮"],
    ji: ["嫁娶", "移徙", "入宅", "开市", "安葬", "掘井"]
  },
  "3-18": {
    yi: ["出行", "立券", "交易", "入宅", "开市", "动土", "栽种", "安葬", "安门", "挂匾", "拆卸", "修坟", "移柩", "进人口", "开光", "破土", "上梁"],
    ji: ["嫁娶", "安床", "作灶", "探病"]
  },
  "3-19": {
    yi: ["嫁娶", "会亲友", "出行", "入学", "纳采", "入宅", "纳财", "订盟", "动土", "栽种", "安机械", "造车器", "开厕", "安门", "祭祀", "牧养", "修造", "拆卸", "起基", "冠笄", "安香", "出火", "开光", "塑绘"],
    ji: ["作灶", "行丧", "伐木", "作梁"]
  },
  "3-2": {
    yi: ["解除", "扫舍", "移徙", "纳采", "立券", "交易", "入宅", "纳财", "裁衣", "订盟", "动土", "沐浴", "安葬", "修造", "拆卸", "修坟", "移柩", "冠笄", "成服", "除服", "伐木", "破土", "启鑽"],
    ji: ["出行", "祭祀", "作灶", "上梁"]
  },
  "3-20": {
    yi: ["嫁娶", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "栽种", "纳畜", "挂匾", "祭祀", "修造", "拆卸", "入殓", "成服", "出火", "除服", "进人口", "开光", "启鑽", "求嗣"],
    ji: [""]
  },
  "3-21": {
    yi: ["解除", "整手足甲", "理发", "沐浴", "安葬", "祭祀", "入殓", "移柩", "冠笄", "破土", "启鑽"],
    ji: ["嫁娶", "出行", "入宅", "开市", "安门"]
  },
  "3-22": {
    yi: ["嫁娶", "出行", "解除", "扫舍", "整手足甲", "理发", "动土", "安床", "祭祀", "放水", "开池", "开光", "塑绘"],
    ji: ["安葬", "作灶", "行丧", "伐木", "作梁"]
  },
  "3-23": {
    yi: ["会亲友", "出行", "解除", "扫舍", "移徙", "入宅", "开市", "裁衣", "安机械", "造车器", "造畜稠", "冠笄", "雕刻", "作梁"],
    ji: ["嫁娶", "动土", "修坟", "破土"]
  },
  "3-24": {
    yi: ["嫁娶", "出行", "解除", "移徙", "入宅", "动土", "栽种", "纳畜", "安葬", "修造", "拆卸", "成服", "出火", "除服", "进人口", "掘井", "开光"],
    ji: ["置产", "安床"]
  },
  "3-25": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "扫舍", "纳采", "订盟", "动土", "经络", "祈福", "栽种", "祭祀", "牧养", "求医", "修造", "造畜稠", "治病", "拆卸", "起基", "安香", "出火", "定磉"],
    ji: ["安葬", "行丧", "掘井", "斋醮", "作梁"]
  },
  "3-26": {
    yi: ["纳采", "立券", "交易", "纳财", "开市", "订盟", "动土", "沐浴", "安葬", "放水", "起基", "修坟", "移柩", "开光", "立碑", "破土", "启鑽", "塑绘", "定磉"],
    ji: ["入宅", "安门", "祭祀", "谢土"]
  },
  "3-27": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "入宅", "裁衣", "订盟", "祈福", "祭祀", "放水", "入殓", "移柩", "冠笄", "安香", "立碑", "破土", "求嗣", "上梁", "谢土", "斋醮", "合帐"],
    ji: ["掘井"]
  },
  "3-28": {
    yi: ["解除", "整手足甲", "馀事勿取", "捕捉", "结网", "塞穴", "畋猎"],
    ji: ["嫁娶", "安葬", "作灶", "掘井"]
  },
  "3-29": {
    yi: ["移徙", "纳采", "入宅", "动土", "求医", "治病", "开光", "上梁"],
    ji: ["嫁娶", "开市", "安葬"]
  },
  "3-3": {
    yi: ["嫁娶", "出行", "解除", "动土", "祈福", "栽种", "安床", "纳畜", "安葬", "祭祀", "拆卸", "起基", "伐木", "进人口", "开光", "破土", "启鑽", "求嗣", "上梁", "谢土"],
    ji: ["移徙", "入宅", "作灶", "出火", "掘井"]
  },
  "3-30": {
    yi: ["嫁娶", "出行", "解除", "移徙", "纳采", "入宅", "订盟", "祈福", "栽种", "纳畜", "祭祀", "牧养", "入殓", "出火", "开光", "破土", "求嗣"],
    ji: ["动土", "安床", "开仓", "盖屋", "安葬", "作灶"]
  },
  "3-31": {
    yi: ["会亲友", "出行", "纳采", "订盟", "祈福", "安床", "斋醮"],
    ji: ["移徙", "入宅", "安葬"]
  },
  "3-32": {
    yi: ["解除", "扫舍", "动土", "安机械", "沐浴", "盖屋", "安葬", "祭祀", "修造", "造畜稠", "治病", "拆卸", "合寿木", "开生坟", "起基", "入殓", "移柩", "开池", "立碑", "破土", "启鑽"],
    ji: ["出行", "入宅", "开市", "安床", "作灶"]
  },
  "3-33": {
    yi: ["纳采", "订盟", "动土", "祈福", "安葬", "祭祀", "修造", "破土", "上梁"],
    ji: ["嫁娶", "开市"]
  },
  "3-34": {
    yi: ["嫁娶", "出行", "解除", "扫舍", "整手足甲", "纳采", "开市", "动土", "安床", "盖屋", "祭祀", "求医", "修造", "治病", "起基", "合嵴", "上梁", "定磉"],
    ji: ["安葬", "作灶", "行丧", "伐木", "造船", "造庙"]
  },
  "3-35": {
    yi: ["理发", "入学", "习艺", "沐浴", "进人口"],
    ji: ["嫁娶", "入宅"]
  },
  "3-36": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "移徙", "纳采", "立券", "入宅", "开市", "订盟", "动土", "祈福", "栽种", "盖屋", "安葬", "安门", "挂匾", "祭祀", "求医", "修造", "治病", "起基", "进人口", "开光", "求嗣"],
    ji: ["经络", "安床", "作灶"]
  },
  "3-37": {
    yi: ["嫁娶", "出行", "祈福", "纳畜", "祭祀", "求医", "治病", "上梁"],
    ji: ["开市", "安葬"]
  },
  "3-38": {
    yi: ["嫁娶", "解除", "移徙", "入宅", "动土", "栽种", "安床", "修造", "拆卸", "入殓", "修坟", "成服", "出火", "除服", "进人口", "开光"],
    ji: ["出行", "纳采", "开市", "订盟", "纳畜", "安葬", "祭祀", "作灶", "探病", "谢土"]
  },
  "3-39": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "移徙", "立券", "交易", "入宅", "开市", "动土", "安床", "安葬", "挂匾", "祭祀", "拆卸", "出火", "开光", "破土", "启鑽"],
    ji: ["词讼", "掘井"]
  },
  "3-4": {
    yi: ["扫舍", "祭祀", "塞穴"],
    ji: ["嫁娶", "栽种", "安葬", "作灶"]
  },
  "3-40": {
    yi: ["解除", "扫舍", "沐浴", "祭祀", "牧养", "塞穴"],
    ji: ["嫁娶", "安葬", "安门", "行丧"]
  },
  "3-41": {
    yi: ["解除", "移徙", "入宅", "动土", "祈福", "安床", "祭祀", "修造", "造畜稠", "拆卸", "出火", "伐木", "开光", "求嗣"],
    ji: ["嫁娶", "出行", "立券", "纳财", "开市", "栽种", "安葬", "作灶"]
  },
  "3-42": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "造车器", "祭祀", "修造", "治病"],
    ji: ["出行", "开市", "安床", "安葬", "作灶"]
  },
  "3-43": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "栽种", "安床", "挂匾", "祭祀", "拆卸", "出火", "开光", "求嗣"],
    ji: ["安葬", "行丧", "伐木", "作梁"]
  },
  "3-44": {
    yi: ["解除", "扫舍", "入学", "沐浴", "祭祀", "牧养", "治病", "开池", "开光", "塑绘"],
    ji: ["嫁娶", "出行", "纳采", "入宅", "作灶"]
  },
  "3-45": {
    yi: ["解除", "扫舍", "整手足甲", "理发", "沐浴", "安葬", "祭祀", "入殓", "移柩", "破土"],
    ji: ["嫁娶", "会亲友", "出行", "移徙", "入宅", "赴任", "作灶", "进人口"]
  },
  "3-46": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "祭祀", "修造"],
    ji: ["安葬", "行丧", "伐木", "造庙", "针灸", "作梁"]
  },
  "3-47": {
    yi: ["出行", "解除", "移徙", "祈福", "安床", "纳畜", "祭祀", "拆卸", "出火", "伐木", "开光", "求嗣"],
    ji: ["嫁娶", "纳采", "动土", "安葬", "作灶", "修坟", "破土", "造庙"]
  },
  "3-48": {
    yi: ["嫁娶", "会亲友", "出行", "扫舍", "移徙", "理发", "入宅", "动土", "栽种", "造车器", "盖屋", "归岫", "安门", "修造", "造畜稠", "拆卸", "起基", "安香", "出火", "雕刻", "合嵴", "开光"],
    ji: ["纳采", "开市", "安床", "安葬", "开渠", "造庙"]
  },
  "3-49": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "祈福", "栽种", "安床", "挂匾", "祭祀", "拆卸", "出火", "求嗣"],
    ji: ["词讼", "安葬", "作灶", "行丧", "伐木", "塑绘"]
  },
  "3-5": {
    yi: ["嫁娶", "会亲友", "移徙", "入宅", "祈福", "造车器", "盖屋", "安门", "祭祀", "治病", "起基", "出火", "掘井", "开池", "开光", "求嗣", "上梁", "竖柱", "斋醮"],
    ji: ["出行", "纳采", "立券", "开市", "安葬", "作灶", "修坟"]
  },
  "3-50": {
    yi: ["会亲友", "解除", "扫舍", "移徙", "入学", "纳采", "立券", "交易", "入宅", "纳财", "开市", "订盟", "安床", "安门", "挂匾", "求医", "治病", "拆卸", "合寿木", "开生坟", "入殓", "修坟", "安香", "出火", "破土", "启鑽"],
    ji: ["出行", "盖屋", "安葬", "祭祀", "探病", "上梁", "谢土"]
  },
  "3-51": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "安床", "安葬", "挂匾", "祭祀", "拆卸", "入殓", "成服", "出火", "除服", "进人口", "开光", "破土", "启鑽", "求嗣", "上梁"],
    ji: [""]
  },
  "3-52": {
    yi: ["扫舍", "馀事勿取", "塞穴"],
    ji: ["诸事不宜"]
  },
  "3-53": {
    yi: ["解除", "扫舍", "纳采", "订盟", "祈福", "栽种", "纳畜", "祭祀", "牧养", "进人口", "开光", "求嗣"],
    ji: ["出行", "入宅", "盖屋", "安葬", "作灶", "修坟", "造桥"]
  },
  "3-54": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "开市", "架马", "安葬", "造畜稠", "拆卸", "入殓", "移柩", "成服", "出火", "除服", "伐木", "开光", "造船", "造庙", "造桥"],
    ji: [""]
  },
  "3-55": {
    yi: ["嫁娶", "出行", "扫舍", "移徙", "纳采", "立券", "纳财", "开市", "订盟", "动土", "祈福", "栽种", "安床", "祭祀", "修造", "造畜稠", "拆卸", "放水", "起基", "安香", "掘井", "开池", "竖柱", "造船", "定磉"],
    ji: ["安葬", "作灶", "行丧", "伐木", "破土", "斋醮"]
  },
  "3-56": {
    yi: ["嫁娶", "会亲友", "移徙", "入宅", "祈福", "盖屋", "祭祀", "治病", "起基", "安香"],
    ji: ["出行", "开市", "经络", "安床", "斋醮"]
  },
  "3-57": {
    yi: ["解除", "动土", "安床", "安门", "祭祀", "修造", "拆卸", "起基", "入殓", "开池", "开渠", "破土", "启鑽", "上梁"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "赴任", "栽种", "作灶", "进人口"]
  },
  "3-58": {
    yi: ["出行", "解除", "移徙", "纳采", "入宅", "开市", "动土", "栽种", "安床", "开厕", "修造", "起基", "冠笄", "雕刻", "合嵴", "上梁"],
    ji: ["安葬", "安门", "行丧", "造庙"]
  },
  "3-59": {
    yi: ["出行", "解除", "理发", "安床", "祭祀", "造畜稠", "拆卸", "出火", "伐木", "合嵴", "开光", "上梁"],
    ji: ["嫁娶", "动土", "词讼", "安葬", "作灶", "行丧", "破土", "造桥"]
  },
  "3-6": {
    yi: ["嫁娶", "出行", "纳采", "订盟", "动土", "祈福", "安葬", "祭祀", "破土", "上梁", "斋醮"],
    ji: ["移徙", "入宅"]
  },
  "3-7": {
    yi: ["嫁娶", "出行", "解除", "移徙", "立券", "交易", "入宅", "纳财", "动土", "祈福", "栽种", "安床", "纳畜", "挂匾", "祭祀", "修造", "造畜稠", "拆卸", "出火", "进人口", "开光", "求嗣"],
    ji: ["安葬", "开生坟", "行丧"]
  },
  "3-8": {
    yi: ["嫁娶", "祈福", "安葬", "祭祀", "治病", "破土", "斋醮"],
    ji: ["入宅", "开市"]
  },
  "3-9": {
    yi: ["解除", "动土", "祈福", "安床", "纳畜", "盖屋", "安葬", "祭祀", "修造", "起基", "入殓", "合嵴", "破土", "求嗣", "上梁", "竖柱"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "开市", "赴任", "词讼", "出火", "进人口", "开光"]
  },
  "4-0": {
    yi: ["会亲友", "理发", "纳采", "裁衣", "订盟", "安床", "沐浴", "安葬", "开生坟", "移柩", "冠笄", "成服", "除服", "启鑽"],
    ji: ["嫁娶", "出行", "入宅", "开市", "动土", "祈福", "安门", "修坟", "上梁", "谢土"]
  },
  "4-1": {
    yi: ["会亲友", "理发", "补垣", "结网", "塞穴"],
    ji: ["嫁娶", "移徙", "入宅", "安门"]
  },
  "4-10": {
    yi: ["嫁娶", "会亲友", "理发", "经络", "栽种", "沐浴", "牧养", "补垣", "开光", "塞穴", "塑绘"],
    ji: ["入宅", "开市", "动土", "祈福", "安床", "开仓", "安葬", "作灶", "破土", "上梁"]
  },
  "4-11": {
    yi: [""],
    ji: ["诸事不宜"]
  },
  "4-12": {
    yi: ["会亲友", "解除", "移徙", "入学", "纳采", "立券", "交易", "开市", "出货财", "订盟", "安床", "开仓", "纳畜", "开厕", "安葬", "牧养", "起基", "入殓", "问名", "成服", "除服", "启鑽"],
    ji: ["入宅", "出火", "上梁", "谢土", "斋醮"]
  },
  "4-13": {
    yi: [""],
    ji: ["诸事不宜"]
  },
  "4-14": {
    yi: ["会亲友", "纳采", "订盟", "栽种", "安机械", "纳畜", "盖屋", "安葬", "修造", "造畜稠", "起基", "入殓", "修坟", "移柩", "开光", "立碑", "启鑽", "上梁", "竖柱", "造桥"],
    ji: ["嫁娶", "入宅", "开市", "动土", "祈福", "出火", "破土"]
  },
  "4-15": {
    yi: ["嫁娶", "纳采", "立券", "交易", "纳财", "开市", "安床", "纳畜", "取渔", "补垣", "开池"],
    ji: ["入宅", "动土", "祈福", "安葬", "安门", "修造", "作灶", "探病", "掘井", "上梁"]
  },
  "4-16": {
    yi: ["会亲友", "理发", "冠笄", "捕捉", "结网", "开光", "求嗣"],
    ji: ["开市", "动土", "安葬", "破土"]
  },
  "4-17": {
    yi: ["会亲友", "理发", "入学", "纳采", "立券", "交易", "纳财", "开市", "裁衣", "经络", "祈福", "安床", "安机械", "架马", "安门", "祭祀", "造仓", "冠笄", "开光", "开柱眼", "求嗣", "塑绘", "作梁", "合帐"],
    ji: ["嫁娶", "出行", "安葬", "斋醮"]
  },
  "4-18": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "纳采", "交易", "订盟", "安床", "纳畜", "安葬", "牧养", "入殓", "移柩", "成服", "除服", "进人口", "启鑽", "求嗣"],
    ji: ["开市", "动土", "祈福", "修造", "破土", "谢土"]
  },
  "4-19": {
    yi: ["会亲友", "进人口"],
    ji: ["动土", "词讼", "安葬", "伐木", "塞穴", "上梁"]
  },
  "4-2": {
    yi: ["会亲友", "出行", "解除", "纳采", "立券", "交易", "开市", "订盟", "安床", "安机械", "盖屋", "安葬", "安门", "拆卸", "起基", "入殓", "修坟", "移柩", "成服", "除服", "伐木", "立碑", "平治道涂", "启鑽", "上梁", "竖柱"],
    ji: ["嫁娶", "入宅", "动土", "祈福", "出火", "破土"]
  },
  "4-20": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "架马", "安葬", "挂匾", "修造", "合寿木", "开生坟", "起基", "入殓", "移柩", "冠笄", "安香", "成服", "出火", "除服", "伐木", "开光", "开柱眼", "求嗣"],
    ji: ["出货财", "动土", "安床", "作灶", "破土"]
  },
  "4-21": {
    yi: ["嫁娶", "解除", "扫舍", "理发", "开市", "安床", "安葬", "牧养", "入殓", "移柩", "开光", "启鑽"],
    ji: ["移徙", "入宅", "动土", "祈福", "栽种", "修造", "作灶", "上梁"]
  },
  "4-22": {
    yi: ["嫁娶", "会亲友", "裁衣", "经络", "栽种", "纳畜", "牧养", "冠笄", "补垣", "捕捉", "进人口", "塞穴", "塑绘"],
    ji: ["开市", "动土", "祈福", "安葬", "行丧"]
  },
  "4-23": {
    yi: ["出行", "移徙", "立券", "交易", "入宅", "开市", "安床", "挂匾", "出火", "开光", "上梁"],
    ji: ["嫁娶", "理发", "乘船", "安葬", "作灶", "行丧"]
  },
  "4-24": {
    yi: ["会亲友", "理发", "立券", "交易", "纳财", "开市", "安床", "沐浴", "冠笄", "教牛马", "结网"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "祈福"]
  },
  "4-25": {
    yi: ["会亲友", "理发", "裁衣", "安床", "安门", "结网", "开光"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "动土", "祈福", "栽种", "安葬", "冠笄", "出火", "伐木", "上梁"]
  },
  "4-26": {
    yi: ["会亲友", "扫舍", "立券", "交易", "纳财", "开市", "动土", "经络", "栽种", "安床", "安葬", "祭祀", "牧养", "求医", "修造", "治病", "拆卸", "合寿木", "开生坟", "入殓", "安香", "进人口", "启鑽"],
    ji: ["嫁娶", "移徙", "入宅", "祈福", "出火"]
  },
  "4-27": {
    yi: ["嫁娶", "出行", "理发", "立券", "交易", "纳财", "开市", "安床", "安葬", "牧养", "修坟", "开池", "启鑽"],
    ji: ["入宅", "动土", "祈福", "修造", "作灶", "掘井", "上梁", "谢土"]
  },
  "4-28": {
    yi: ["纳采", "入宅", "开仓", "祭祀", "问名", "求嗣", "合帐"],
    ji: ["安床", "安葬", "作灶", "斋醮"]
  },
  "4-29": {
    yi: ["立券", "交易", "纳财", "开市", "安床", "盖屋", "修造", "起基", "开光", "上梁"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "赴任", "动土", "词讼", "安葬", "行丧", "破土", "谢土"]
  },
  "4-3": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "裁衣", "订盟", "安床", "安葬", "祭祀", "入殓", "进人口", "启鑽"],
    ji: [""]
  },
  "4-30": {
    yi: ["会亲友", "开市", "安床", "安葬", "祭祀", "启鑽"],
    ji: ["嫁娶", "动土", "破土"]
  },
  "4-31": {
    yi: ["纳采", "裁衣", "安床", "造仓", "作灶", "冠笄", "进人口", "开光", "塞穴"],
    ji: ["嫁娶", "出行", "动土", "栽种", "安葬", "修造", "伐木", "谢土", "作梁"]
  },
  "4-32": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "开市", "安葬", "求医", "治病", "启鑽"],
    ji: ["动土", "破土"]
  },
  "4-33": {
    yi: ["嫁娶", "出行", "纳采", "立券", "交易", "开市", "订盟", "栽种", "安床", "造车器", "牧养", "拆卸", "起基", "入殓", "移柩", "成服", "除服", "开光", "启鑽"],
    ji: ["入宅", "动土", "祈福", "祭祀", "修造", "破土", "上梁", "斋醮"]
  },
  "4-34": {
    yi: ["会亲友", "出行", "移徙", "纳采", "入宅", "订盟", "修造", "上梁"],
    ji: ["开市", "安葬"]
  },
  "4-35": {
    yi: ["移徙", "纳采", "立券", "交易", "入宅", "纳财", "开市", "订盟", "栽种", "安床", "安门", "挂匾", "修造", "拆卸", "出火", "进人口", "开光"],
    ji: ["嫁娶", "动土", "安葬", "作灶", "行丧", "破土", "斋醮"]
  },
  "4-36": {
    yi: ["会亲友", "安葬", "开光", "启鑽", "针灸"],
    ji: ["开市", "动土", "破土"]
  },
  "4-37": {
    yi: ["会亲友", "理发", "祭祀", "牧养", "造畜稠", "结网", "开池", "塑绘", "畋猎"],
    ji: ["嫁娶", "出行", "入宅", "开市", "动土", "祈福", "安葬", "作灶", "上梁", "谢土"]
  },
  "4-38": {
    yi: ["解除", "立券", "开市", "安机械", "安葬", "开光", "启鑽", "上梁"],
    ji: ["嫁娶", "祈福"]
  },
  "4-39": {
    yi: ["嫁娶", "出行", "立券", "交易", "纳财", "栽种", "安床", "安葬", "起基", "入殓", "移柩"],
    ji: ["入宅", "动土", "词讼", "祈福", "安门", "挂匾", "作灶", "掘井", "开池", "破土", "上梁", "作梁"]
  },
  "4-4": {
    yi: ["会亲友", "经络", "祈福", "安床", "安机械", "祭祀", "冠笄", "求嗣"],
    ji: ["嫁娶", "开市", "动土", "安葬", "作灶"]
  },
  "4-40": {
    yi: ["嫁娶", "会亲友", "安床", "牧养", "开光", "求嗣", "塑绘", "针灸"],
    ji: ["移徙", "立券", "交易", "入宅", "开市", "动土", "安葬", "分居", "作灶", "安香", "出火", "伐木"]
  },
  "4-41": {
    yi: ["会亲友", "理发", "立券", "交易", "纳财", "开市", "安床", "造仓", "结网", "开光", "针灸"],
    ji: ["移徙", "入宅", "栽种"]
  },
  "4-42": {
    yi: ["嫁娶", "会亲友", "出行", "理发", "纳采", "开市", "栽种", "安床", "牧养", "入殓", "移柩", "开光", "启鑽"],
    ji: ["入宅", "祈福", "安门", "修造", "作灶", "上梁", "谢土", "斋醮"]
  },
  "4-43": {
    yi: ["嫁娶", "会亲友", "纳采", "订盟", "经络", "安机械", "祭祀", "冠笄", "结网", "进人口", "求嗣"],
    ji: ["开市", "动土", "安葬", "作灶", "行丧"]
  },
  "4-44": {
    yi: ["出行", "解除", "移徙", "立券", "交易", "入宅", "开市", "栽种", "安葬", "牧养", "修造", "拆卸", "起基", "入殓", "成服", "出火", "除服", "伐木", "开光", "求嗣", "上梁"],
    ji: ["置产", "安床"]
  },
  "4-45": {
    yi: ["出行", "解除", "扫舍", "移徙", "立券", "交易", "纳财", "开市", "出货财", "祈福", "栽种", "安床", "开仓", "纳畜", "祭祀", "牧养", "起基", "补垣", "开光", "求嗣", "塞穴", "竖柱"],
    ji: ["入宅", "安葬", "安门", "行丧", "破土", "斋醮"]
  },
  "4-46": {
    yi: ["栽种", "纳畜", "牧养", "补垣", "进人口", "开光", "塞穴", "塑绘"],
    ji: ["嫁娶", "立券", "交易", "纳财", "开市", "动土", "祈福", "安葬", "修造", "上梁"]
  },
  "4-47": {
    yi: ["出行", "移徙", "立券", "交易", "开市", "安机械", "出火", "上梁"],
    ji: ["嫁娶", "动土", "安葬", "造桥"]
  },
  "4-48": {
    yi: ["会亲友", "理发", "立券", "交易", "纳财", "开市", "安葬", "入殓", "移柩", "开光", "启鑽"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "祈福", "安床", "作灶", "出火", "上梁"]
  },
  "4-49": {
    yi: ["会亲友", "裁衣", "经络", "安机械", "结网", "塞穴", "塑绘"],
    ji: ["嫁娶", "开市", "祈福", "安葬", "斋醮"]
  },
  "4-5": {
    yi: ["会亲友", "解除", "立券", "交易", "纳财", "开市", "裁衣", "开仓", "安机械", "盖屋", "造仓", "拆卸", "冠笄", "伐木", "开光", "上梁", "竖柱", "塑绘"],
    ji: ["嫁娶", "出行", "入宅", "安葬"]
  },
  "4-50": {
    yi: ["解除", "理发", "立券", "交易", "开市", "栽种", "安床", "安葬", "挂匾", "修造", "拆卸", "开光"],
    ji: ["嫁娶", "移徙", "入宅", "祈福", "盖屋", "祭祀", "作灶", "探病", "掘井", "谢土"]
  },
  "4-51": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "入学", "纳采", "立券", "交易", "纳财", "习艺", "出货财", "订盟", "经络", "祈福", "安床", "开仓", "纳畜", "安葬", "祭祀", "入殓", "修坟", "启鑽", "求嗣"],
    ji: ["入宅", "开市", "动土", "开光"]
  },
  "4-52": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "祈福", "安床", "安机械", "盖屋", "安门", "祭祀", "牧养", "修造", "起基", "冠笄", "开光", "上梁", "畋猎"],
    ji: ["移徙", "入宅", "安葬", "治病", "作灶"]
  },
  "4-53": {
    yi: ["会亲友", "解除", "纳采", "立券", "交易", "纳财", "开市", "裁衣", "订盟", "经络", "栽种", "安床", "安机械", "冠笄", "结网", "开光", "上梁", "竖柱", "塑绘", "合帐"],
    ji: ["出行", "入宅", "安葬", "作灶"]
  },
  "4-54": {
    yi: ["嫁娶", "出行", "理发", "交易", "开市", "安床", "开光", "塞穴"],
    ji: ["置产", "入宅", "动土", "祈福", "安葬", "修造", "出火", "破土", "上梁"]
  },
  "4-55": {
    yi: ["置产", "牧养", "馀事勿取", "结网", "进人口", "塞穴"],
    ji: ["诸事不宜"]
  },
  "4-56": {
    yi: ["嫁娶", "出行", "解除", "扫舍", "移徙", "入宅", "纳财", "开市", "祈福", "栽种", "盖屋", "安葬", "祭祀", "修造", "造仓", "作灶", "拆卸", "放水", "起基", "安香", "补垣", "出火", "开光", "塞穴", "上梁", "竖柱", "造船"],
    ji: ["纳采", "订盟", "动土", "安床", "破土", "谢土"]
  },
  "4-57": {
    yi: ["嫁娶", "出行", "立券", "交易", "裁衣", "安葬", "牧养", "造畜稠", "开生坟", "入殓", "移柩", "冠笄", "成服", "除服", "进人口", "纳婿", "启鑽", "塑绘"],
    ji: [""]
  },
  "4-58": {
    yi: ["会亲友", "出行", "解除", "移徙", "纳采", "入宅", "订盟", "经络", "栽种", "安床", "安机械", "纳畜", "修造", "拆卸", "安香", "出火", "开光", "上梁"],
    ji: ["动土", "祈福", "安葬", "祭祀", "作灶", "行丧", "伐木", "破土", "谢土"]
  },
  "4-59": {
    yi: ["出行", "解除", "开市", "裁衣", "开厕", "挂匾", "作灶", "冠笄", "补垣", "开池", "开光", "塞穴", "塑绘"],
    ji: [""]
  },
  "4-6": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "开市", "安床", "安葬", "祭祀", "移柩", "成服", "除服", "结网", "开光", "启鑽", "塑绘"],
    ji: ["入宅", "动土", "祈福", "盖屋", "探病", "破土"]
  },
  "4-7": {
    yi: ["会亲友", "纳采", "订盟", "安床", "造畜稠", "作灶"],
    ji: ["开市", "安葬"]
  },
  "4-8": {
    yi: ["解除", "扫舍", "纳采", "开市", "祈福", "安机械", "沐浴", "归岫", "安葬", "祭祀", "修造", "拆卸", "放水", "合寿木", "开生坟", "安碓磑", "补垣", "成服", "出火", "除服", "开柱眼", "启鑽", "求嗣", "塞穴", "上梁", "竖柱", "谢土"],
    ji: ["嫁娶", "动土", "安床", "作灶", "破土", "造船"]
  },
  "4-9": {
    yi: ["嫁娶", "出行", "开市", "安床", "安葬", "入殓", "启鑽"],
    ji: ["动土", "祈福", "破土"]
  },
  "5-0": {
    yi: ["修饰垣墙", "祈福", "祭祀", "入殓", "移柩", "平治道涂"],
    ji: ["嫁娶", "入宅", "安门", "上梁"]
  },
  "5-1": {
    yi: ["解除", "修饰垣墙", "祭祀", "造畜稠", "馀事勿取", "平治道涂"],
    ji: ["嫁娶", "入学", "交易", "入宅", "开市", "安葬"]
  },
  "5-10": {
    yi: ["嫁娶", "裁衣", "沐浴", "祭祀", "冠笄", "结网"],
    ji: ["置产", "出货财", "动土", "栽种", "开仓", "安葬", "掘井", "破土"]
  },
  "5-11": {
    yi: ["理发", "修饰垣墙", "沐浴", "祭祀", "作灶", "平治道涂"],
    ji: ["嫁娶", "祈福", "栽种", "安葬", "安门", "伐木", "造桥", "作梁"]
  },
  "5-12": {
    yi: ["沐浴", "入殓", "移柩", "成服", "除服", "平治道涂", "破土"],
    ji: ["嫁娶", "移徙", "入宅", "开市"]
  },
  "5-13": {
    yi: ["祭祀", "馀事勿取", "平治道涂"],
    ji: ["嫁娶", "开市"]
  },
  "5-14": {
    yi: ["出行", "移徙", "立券", "交易", "入宅", "纳财", "开市", "安床", "纳畜", "安葬", "挂匾", "入殓", "移柩", "开光"],
    ji: ["嫁娶", "置产", "动土", "祈福", "栽种", "祭祀", "作灶", "破土"]
  },
  "5-15": {
    yi: ["祭祀", "修坟", "馀事勿取", "成服", "除服", "平治道涂"],
    ji: ["嫁娶", "移徙", "入宅", "安葬", "掘井"]
  },
  "5-16": {
    yi: ["解除", "修饰垣墙", "祭祀", "平治道涂"],
    ji: ["馀事勿取"]
  },
  "5-17": {
    yi: ["祭祀", "馀事勿取", "平治道涂"],
    ji: ["嫁娶", "祈福", "安葬", "掘井"]
  },
  "5-18": {
    yi: ["嫁娶", "安葬", "祭祀", "纳婿"],
    ji: ["入宅", "栽种", "盖屋", "作灶"]
  },
  "5-19": {
    yi: ["祭祀", "作灶", "馀事勿取", "平治道涂"],
    ji: ["嫁娶", "动土", "安床", "安葬", "治病"]
  },
  "5-2": {
    yi: ["会亲友", "出行", "移徙", "纳采", "立券", "交易", "入宅", "纳财", "开市", "赴任", "裁衣", "订盟", "动土", "经络", "祈福", "安床", "开仓", "安葬", "祭祀", "修造", "拆卸", "起基", "入殓", "移柩", "安香", "成服", "除服", "进人口", "上梁", "竖柱", "谢土"],
    ji: ["治病", "作灶", "伐木", "作梁"]
  },
  "5-20": {
    yi: ["扫舍", "沐浴", "安葬", "入殓", "成服", "除服", "平治道涂", "破土"],
    ji: ["嫁娶", "移徙", "祈福", "安床", "盖屋", "祭祀", "伐木", "作梁"]
  },
  "5-21": {
    yi: ["嫁娶", "扫舍", "整手足甲", "理发", "修饰垣墙", "沐浴", "祭祀", "作灶", "平治道涂"],
    ji: ["出行", "治病", "合寿木", "斋醮"]
  },
  "5-22": {
    yi: ["解除", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "5-23": {
    yi: ["出行", "移徙", "纳采", "裁衣", "订盟", "沐浴", "纳畜", "牧养", "上梁", "竖柱"],
    ji: ["嫁娶", "动土", "安葬", "安门"]
  },
  "5-24": {
    yi: ["修饰垣墙", "沐浴", "祭祀", "馀事勿取", "平治道涂"],
    ji: ["诸事不宜"]
  },
  "5-25": {
    yi: ["修饰垣墙", "祭祀", "造畜稠", "馀事勿取", "平治道涂"],
    ji: ["嫁娶", "开市", "安床", "掘井"]
  },
  "5-26": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "动土", "栽种", "安床", "修造", "拆卸", "出火", "开光", "上梁"],
    ji: ["祈福", "祭祀", "作灶", "伐木", "掘井", "谢土"]
  },
  "5-27": {
    yi: ["祭祀", "入殓", "移柩", "馀事勿取"],
    ji: ["入宅", "动土", "安门", "修造", "破土", "上梁"]
  },
  "5-28": {
    yi: ["解除", "馀事勿取", "平治道涂"],
    ji: ["移徙", "入宅", "栽种", "治病", "掘井", "开池", "造庙", "针灸"]
  },
  "5-29": {
    yi: ["作灶", "平治道涂"],
    ji: ["祈福", "安葬", "安门", "祭祀", "馀事勿取"]
  },
  "5-3": {
    yi: ["安葬", "祭祀", "馀事勿取", "成服", "除服", "平治道涂"],
    ji: ["嫁娶", "纳采", "入宅", "订盟", "掘井"]
  },
  "5-30": {
    yi: ["嫁娶", "置产", "修饰垣墙", "祈福", "祭祀", "冠笄", "平治道涂"],
    ji: ["立券", "交易", "开市", "出货财", "栽种", "开仓", "盖屋", "作灶"]
  },
  "5-31": {
    yi: ["祭祀", "作灶", "掘井", "平治道涂"],
    ji: ["嫁娶", "安葬"]
  },
  "5-32": {
    yi: ["嫁娶", "出行", "移徙", "理发", "纳采", "立券", "交易", "开市", "裁衣", "动土", "栽种", "纳畜", "挂匾", "修造", "进人口", "上梁"],
    ji: ["祈福", "安床", "安葬", "祭祀", "伐木"]
  },
  "5-33": {
    yi: ["嫁娶", "扫舍", "修饰垣墙", "沐浴", "祭祀"],
    ji: ["安葬", "行丧"]
  },
  "5-34": {
    yi: ["嫁娶", "祭祀", "结网", "畋猎"],
    ji: ["动土", "治病", "开渠", "破土"]
  },
  "5-35": {
    yi: ["修饰垣墙", "沐浴", "平治道涂"],
    ji: ["嫁娶", "祈福", "馀事勿取"]
  },
  "5-36": {
    yi: ["修饰垣墙", "沐浴", "祭祀", "馀事勿取", "平治道涂"],
    ji: ["嫁娶", "出行", "入宅", "安床"]
  },
  "5-37": {
    yi: ["祭祀", "造畜稠", "结网"],
    ji: ["馀事勿取"]
  },
  "5-38": {
    yi: ["会亲友", "出行", "移徙", "立券", "交易", "修饰垣墙", "入宅", "纳财", "开市", "出货财", "裁衣", "动土", "经络", "拆卸", "安香", "进人口", "平治道涂"],
    ji: ["安葬", "作灶", "修坟", "行丧", "探病", "伐木", "谢土", "造庙", "作梁"]
  },
  "5-39": {
    yi: ["馀事勿取", "平治道涂"],
    ji: ["诸事不宜"]
  },
  "5-4": {
    yi: ["修饰垣墙", "入殓", "移柩", "馀事勿取", "平治道涂"],
    ji: ["嫁娶", "移徙", "入宅", "开光"]
  },
  "5-40": {
    yi: ["馀事勿取", "平治道涂"],
    ji: ["嫁娶", "出货财", "开仓", "安葬", "探病", "开光", "造船"]
  },
  "5-41": {
    yi: ["解除", "作灶", "平治道涂"],
    ji: ["出行", "祈福", "栽种", "纳畜", "安葬", "安门", "牧养", "行丧", "伐木", "作梁"]
  },
  "5-42": {
    yi: ["嫁娶", "会亲友", "立券", "交易", "置产", "纳财", "安机械", "冠笄"],
    ji: ["开市", "盖屋", "治病", "作灶"]
  },
  "5-43": {
    yi: ["解除", "修饰垣墙", "祭祀", "馀事勿取", "平治道涂"],
    ji: ["诸事不宜"]
  },
  "5-44": {
    yi: ["扫舍", "移徙", "沐浴", "安葬", "祭祀", "平治道涂", "破土"],
    ji: ["嫁娶", "入宅", "祈福", "安床", "作灶"]
  },
  "5-45": {
    yi: ["扫舍", "整手足甲", "理发", "修饰垣墙", "沐浴", "祭祀", "平治道涂"],
    ji: ["嫁娶", "出行", "入宅", "安门", "修造", "上梁"]
  },
  "5-46": {
    yi: ["修饰垣墙", "祭祀", "平治道涂"],
    ji: ["嫁娶", "开市", "动土", "安葬", "修造", "破土"]
  },
  "5-47": {
    yi: ["修饰垣墙", "沐浴", "作灶", "馀事勿取", "平治道涂"],
    ji: ["诸事不宜"]
  },
  "5-48": {
    yi: ["修饰垣墙", "沐浴", "祭祀", "馀事勿取", "平治道涂"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "上梁", "斋醮"]
  },
  "5-49": {
    yi: ["造畜稠", "馀事勿取", "平治道涂"],
    ji: ["诸事不宜"]
  },
  "5-5": {
    yi: ["解除", "作灶", "馀事勿取", "平治道涂"],
    ji: ["祈福", "安葬", "安门", "祭祀"]
  },
  "5-50": {
    yi: ["会亲友", "出行", "移徙", "纳采", "立券", "交易", "修饰垣墙", "入宅", "纳财", "开市", "动土", "开厕", "修造", "起基", "安香", "出火", "开池", "平治道涂", "竖柱", "造庙", "定磉"],
    ji: ["开仓", "盖屋", "祭祀", "造桥"]
  },
  "5-51": {
    yi: ["修饰垣墙", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "5-52": {
    yi: ["嫁娶", "会亲友", "裁衣", "祭祀", "冠笄", "结网", "进人口", "平治道涂"],
    ji: ["移徙", "入宅", "安葬", "治病", "作灶", "造庙"]
  },
  "5-53": {
    yi: ["修饰垣墙", "祭祀", "馀事勿取", "平治道涂"],
    ji: ["诸事不宜"]
  },
  "5-54": {
    yi: ["嫁娶", "祭祀", "入殓", "移柩", "成服", "除服", "纳婿"],
    ji: ["入宅", "动土", "安床", "作灶", "开光"]
  },
  "5-55": {
    yi: ["修饰垣墙", "祭祀", "作灶", "馀事勿取", "结网", "平治道涂", "畋猎"],
    ji: ["嫁娶", "安床", "治病"]
  },
  "5-56": {
    yi: ["嫁娶", "出行", "开光"],
    ji: ["会亲友", "移徙", "开市", "动土", "纳畜", "安葬", "修造", "起基", "入殓", "修坟", "移柩", "成服", "除服", "进人口", "立碑", "破土"]
  },
  "5-57": {
    yi: ["嫁娶", "整手足甲", "理发", "修饰垣墙", "沐浴", "祭祀", "作灶", "冠笄", "平治道涂"],
    ji: ["出行", "栽种", "破土"]
  },
  "5-58": {
    yi: ["嫁娶", "祭祀", "取渔", "冠笄", "捕捉", "结网", "畋猎"],
    ji: ["馀事勿取"]
  },
  "5-59": {
    yi: ["修饰垣墙", "沐浴", "祭祀", "作灶", "平治道涂"],
    ji: ["嫁娶", "置产", "词讼", "祈福", "栽种", "安葬", "安门", "治病", "伐木", "作梁"]
  },
  "5-6": {
    yi: ["修饰垣墙", "入殓", "移柩", "冠笄", "成服", "除服", "平治道涂"],
    ji: ["盖屋", "治病", "作灶", "探病"]
  },
  "5-7": {
    yi: ["祭祀", "作灶", "馀事勿取", "平治道涂"],
    ji: ["入宅", "栽种", "安床", "安碓磑"]
  },
  "5-8": {
    yi: ["扫舍", "沐浴", "安葬", "入殓", "移柩", "馀事勿取", "平治道涂", "破土", "启鑽"],
    ji: ["诸事不宜"]
  },
  "5-9": {
    yi: ["整手足甲", "理发", "修饰垣墙", "沐浴", "祭祀", "馀事勿取", "平治道涂"],
    ji: ["出行", "入宅", "开市", "词讼", "修造"]
  },
  "6-0": {
    yi: ["嫁娶", "出行", "解除", "移徙", "立券", "交易", "入宅", "动土", "祈福", "安床", "安葬", "祭祀", "修造", "拆卸", "入殓", "安香", "成服", "出火", "除服", "进人口", "开光", "破土", "求嗣", "谢土"],
    ji: ["开市", "开仓", "作灶", "造船", "斋醮"]
  },
  "6-1": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "立券", "交易", "开市", "赴任", "裁衣", "动土", "经络", "安葬", "祭祀", "修造", "入殓", "移柩", "安香", "成服", "除服", "进人口", "开光", "上梁", "塑绘", "斋醮"],
    ji: ["入宅", "伐木"]
  },
  "6-10": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "立券", "入宅", "动土", "祈福", "安葬", "祭祀", "破土"],
    ji: ["开仓", "盖屋", "架马", "作灶", "开光"]
  },
  "6-11": {
    yi: ["移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "安床", "修造", "拆卸", "出火", "进人口", "开光", "求嗣"],
    ji: ["嫁娶", "置产", "栽种", "安葬", "修坟", "行丧", "破土"]
  },
  "6-12": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "安机械", "盖屋", "安葬", "安门", "祭祀", "修造", "起基", "开光", "破土", "普渡", "上梁", "竖柱", "斋醮", "定磉"],
    ji: ["立券", "置产", "开市", "作灶", "造桥"]
  },
  "6-13": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "栽种", "安床", "沐浴", "纳畜", "安葬", "祭祀", "修造", "拆卸", "入殓", "成服", "出火", "除服", "进人口", "启鑽", "求嗣"],
    ji: [""]
  },
  "6-14": {
    yi: ["馀事勿取", "捕捉", "畋猎"],
    ji: ["交易", "入宅", "开市", "安葬", "祭祀"]
  },
  "6-15": {
    yi: ["嫁娶", "出行", "解除", "移徙", "入宅", "动土", "祈福", "栽种", "安床", "纳畜", "安葬", "祭祀", "修造", "拆卸", "入殓", "成服", "出火", "除服", "进人口", "开光", "立碑", "求嗣"],
    ji: [""]
  },
  "6-16": {
    yi: ["嫁娶", "出行", "移徙", "入学", "入宅", "动土", "祈福", "盖屋", "安葬", "安门", "祭祀", "修造", "造畜稠", "起基", "冠笄", "安香", "成服", "出火", "除服", "雕刻", "掘井", "开光", "破土", "求嗣", "上梁", "竖柱"],
    ji: ["纳采", "开市", "订盟", "经络", "作灶", "造船", "造庙"]
  },
  "6-17": {
    yi: ["嫁娶", "会亲友", "动土", "祈福", "纳畜", "开厕", "祭祀", "牧养", "造仓", "起基", "进人口", "求嗣"],
    ji: ["出行", "入宅", "开市", "栽种", "安葬", "安门", "作灶", "掘井"]
  },
  "6-18": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "开市", "动土", "祈福", "安机械", "安葬", "修造", "入殓", "移柩", "成服", "除服", "伐木", "破土", "求嗣", "谢土", "造庙", "斋醮"],
    ji: ["置产", "盖屋", "安门", "作灶", "探病", "合嵴", "开光"]
  },
  "6-19": {
    yi: ["会亲友", "出行", "移徙", "入学", "立券", "入宅", "裁衣", "订盟", "经络", "安机械", "安葬", "安门", "祭祀", "拆卸", "放水", "起基", "入殓", "移柩", "成服", "除服", "开光", "立碑", "启鑽", "上梁", "竖柱", "塑绘", "定磉", "合帐"],
    ji: ["伐木", "作梁"]
  },
  "6-2": {
    yi: ["安葬", "入殓", "馀事勿取", "成服", "除服", "破土", "启鑽"],
    ji: ["置产", "入宅", "开市", "祭祀", "补垣", "塞穴"]
  },
  "6-20": {
    yi: ["交易", "开市", "祈福", "安机械", "纳畜", "造车器", "盖屋", "安葬", "安门", "祭祀", "开生坟", "起基", "雕刻", "合嵴", "开光", "立碑", "求嗣", "谢土", "斋醮", "定磉"],
    ji: ["入宅", "出货财", "动土", "开仓"]
  },
  "6-21": {
    yi: ["嫁娶", "出行", "解除", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "安床", "安葬", "安门", "挂匾", "祭祀", "拆卸", "出火", "进人口", "开光", "破土", "求嗣", "上梁", "谢土"],
    ji: [""]
  },
  "6-22": {
    yi: ["会亲友", "出行", "解除", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "安床", "安机械", "盖屋", "安葬", "祭祀", "修造", "拆卸", "起基", "入殓", "安香", "出火", "立碑", "破土", "斋醮", "定磉"],
    ji: ["开市", "作灶", "伐木", "作梁"]
  },
  "6-23": {
    yi: ["入宅", "动土", "祈福", "安床", "纳畜", "挂匾", "祭祀", "修造", "拆卸", "出火", "伐木", "开光", "求嗣", "上梁"],
    ji: ["嫁娶", "理发", "栽种", "作灶", "修坟", "行丧"]
  },
  "6-24": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "盖屋", "安葬", "安门", "祭祀", "修造", "起基", "安香", "出火", "开光", "破土", "普渡", "启鑽", "上梁", "竖柱", "造庙", "造桥"],
    ji: ["立券", "纳财", "开市", "作灶"]
  },
  "6-25": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "栽种", "安床", "纳畜", "安葬", "挂匾", "祭祀", "修造", "拆卸", "入殓", "成服", "出火", "除服", "进人口", "开光", "求嗣"],
    ji: [""]
  },
  "6-26": {
    yi: ["安葬", "入殓", "移柩", "捕捉", "成服", "除服", "结网", "立碑", "破土", "启鑽"],
    ji: ["嫁娶", "移徙", "入宅", "盖屋", "祭祀"]
  },
  "6-27": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "祈福", "安床", "安葬", "挂匾", "祭祀", "拆卸", "出火", "伐木", "开光", "求嗣"],
    ji: ["置产", "栽种", "掘井"]
  },
  "6-28": {
    yi: ["纳采", "入宅", "赴任", "裁衣", "订盟", "安床", "安葬", "修造", "拆卸", "冠笄", "出火", "开光", "塑绘", "谢土"],
    ji: ["作灶", "伐木", "掘井", "斋醮"]
  },
  "6-29": {
    yi: ["嫁娶", "移徙", "入宅", "动土", "安床", "纳畜", "祭祀", "修造", "拆卸", "出火", "伐木", "开光", "上梁"],
    ji: ["出行", "置产", "开市", "出货财", "词讼", "栽种", "安葬", "治病", "行丧"]
  },
  "6-3": {
    yi: ["会亲友", "移徙", "纳采", "入宅", "赴任", "裁衣", "订盟", "动土", "祈福", "安床", "安葬", "祭祀", "修造", "拆卸", "起基", "入殓", "移柩", "安香", "进人口", "谢土"],
    ji: ["治病", "作灶"]
  },
  "6-30": {
    yi: ["会亲友", "出行", "纳采", "纳财", "裁衣", "订盟", "动土", "安床", "沐浴", "纳畜", "安门", "挂匾", "修造", "拆卸", "放水", "安香", "酬神", "出火", "伐木", "进人口", "开光", "上梁", "塑绘", "造庙", "斋醮", "合帐"],
    ji: ["栽种", "盖屋", "安葬", "作灶"]
  },
  "6-31": {
    yi: ["嫁娶", "出行", "扫舍", "移徙", "入宅", "纳财", "祈福", "安床", "安门", "挂匾", "祭祀", "修造", "拆卸", "出火", "进人口", "开光", "求嗣"],
    ji: ["动土", "安葬", "行丧", "伐木"]
  },
  "6-32": {
    yi: ["开市", "动土", "安葬", "祭祀", "入殓", "破土", "斋醮"],
    ji: ["嫁娶", "移徙", "入宅"]
  },
  "6-33": {
    yi: ["出行", "立券", "交易", "开市", "动土", "祈福", "安床", "安机械", "盖屋", "安葬", "挂匾", "祭祀", "修造", "起基", "成服", "除服", "立碑", "破土", "启鑽", "斋醮", "定磉"],
    ji: ["嫁娶", "移徙", "理发", "入宅", "作灶"]
  },
  "6-34": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "开市", "订盟", "动土", "祈福", "安葬", "祭祀", "破土"],
    ji: ["作灶"]
  },
  "6-35": {
    yi: ["会亲友", "出行", "解除", "理发", "入学", "纳采", "立券", "交易", "纳财", "开市", "订盟", "动土", "祈福", "栽种", "纳畜", "祭祀", "牧养", "造仓", "起基", "开光", "求嗣"],
    ji: ["嫁娶", "置产", "入宅", "安葬", "作灶", "出火"]
  },
  "6-36": {
    yi: ["嫁娶", "移徙", "入宅", "动土", "祈福", "祭祀", "斋醮"],
    ji: ["开市", "安葬"]
  },
  "6-37": {
    yi: ["会亲友", "纳财", "动土", "祈福", "栽种", "开厕", "牧养", "修造", "造仓", "开光", "求嗣", "斋醮"],
    ji: ["移徙", "入宅", "祭祀", "作灶", "出火", "进人口", "开渠"]
  },
  "6-38": {
    yi: ["安葬", "入殓", "移柩", "成服", "除服", "破土", "启鑽"],
    ji: ["移徙", "入宅"]
  },
  "6-39": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "立券", "交易", "纳财", "订盟", "动土", "祈福", "安床", "安葬", "祭祀", "修造", "拆卸", "安香", "成服", "出火", "除服", "进人口", "开光", "斋醮"],
    ji: ["置产", "词讼", "栽种", "掘井"]
  },
  "6-4": {
    yi: ["会亲友", "出行", "移徙", "纳采", "订盟", "动土", "祈福", "安床", "安机械", "盖屋", "安葬", "安门", "祭祀", "修造", "拆卸", "起基", "入殓", "安香", "出火", "开光", "破土", "上梁", "竖柱", "造船", "造桥", "定磉"],
    ji: ["置产", "开市", "掘井", "造庙"]
  },
  "6-40": {
    yi: ["纳采", "订盟", "动土", "栽种", "安机械", "纳畜", "安葬", "牧养", "修造", "拆卸", "入殓", "移柩", "成服", "出火", "除服", "破土", "求嗣", "塑绘", "造桥", "斋醮"],
    ji: ["嫁娶", "开市"]
  },
  "6-41": {
    yi: ["嫁娶", "会亲友", "移徙", "纳采", "置产", "入宅", "订盟", "安床", "安机械", "盖屋", "挂匾", "祭祀", "拆卸", "起基", "安香", "出火", "定磉"],
    ji: ["出行", "开市", "安葬", "行丧"]
  },
  "6-42": {
    yi: ["解除", "沐浴"],
    ji: ["诸事不宜"]
  },
  "6-43": {
    yi: ["嫁娶", "移徙", "纳采", "立券", "入宅", "开市", "订盟", "祈福", "安机械", "造车器", "安葬", "祭祀", "破土"],
    ji: ["理发", "纳畜", "合寿木"]
  },
  "6-44": {
    yi: ["解除", "扫舍", "交易", "纳财", "动土", "祈福", "纳畜", "祭祀", "开光"],
    ji: ["嫁娶", "出行", "置产", "赴任", "安床", "安葬", "作灶", "进人口"]
  },
  "6-45": {
    yi: ["移徙", "入宅", "祈福", "安机械", "纳畜", "盖屋", "安葬", "安门", "祭祀", "作灶", "起基", "安香", "出火", "开光", "启鑽", "求嗣", "上梁", "竖柱", "塑绘", "斋醮"],
    ji: ["嫁娶", "动土", "破土"]
  },
  "6-46": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "动土", "祈福", "栽种", "安床", "纳畜", "安葬", "挂匾", "祭祀", "修造", "拆卸", "入殓", "出火", "进人口", "开光", "破土", "启鑽", "求嗣"],
    ji: [""]
  },
  "6-47": {
    yi: ["会亲友", "移徙", "纳采", "立券", "入宅", "订盟", "祈福", "安床", "安机械", "挂匾", "祭祀", "牧养", "拆卸", "安香", "出火", "教牛马", "开光", "上梁", "竖柱"],
    ji: ["嫁娶", "安葬", "修坟", "行丧", "破土"]
  },
  "6-48": {
    yi: ["出行", "解除", "动土", "栽种", "安床", "纳畜", "安葬", "祭祀", "修造", "拆卸", "起基", "入殓", "成服", "出火", "除服", "伐木", "进人口", "开光", "破土", "求嗣", "作梁"],
    ji: ["嫁娶", "移徙"]
  },
  "6-49": {
    yi: ["嫁娶", "出行", "移徙", "立券", "入宅", "开市", "动土", "祈福", "安机械", "造车器", "安葬", "祭祀", "修造", "安香", "出火", "开光", "破土"],
    ji: ["纳采", "订盟", "词讼", "架马", "开渠"]
  },
  "6-5": {
    yi: ["嫁娶", "会亲友", "移徙", "纳采", "入宅", "动土", "祈福", "安床", "纳畜", "祭祀", "修造", "安香", "进人口", "开光", "上梁", "竖柱", "塑绘", "斋醮"],
    ji: ["出行", "开市", "安葬", "治病"]
  },
  "6-50": {
    yi: ["安葬", "入殓", "成服", "除服", "破土", "启鑽"],
    ji: ["馀事勿取"]
  },
  "6-51": {
    yi: ["会亲友", "出行", "移徙", "纳采", "立券", "入宅", "纳财", "开市", "订盟", "动土", "祈福", "盖屋", "安门", "祭祀", "修造", "起基", "安香", "出火", "教牛马", "破土", "上梁", "竖柱"],
    ji: ["嫁娶", "置产", "安葬", "掘井", "造船"]
  },
  "6-52": {
    yi: ["入宅", "动土", "安床", "纳畜", "安葬", "挂匾", "祭祀", "拆卸", "入殓", "出火", "开光", "破土"],
    ji: ["嫁娶", "置产", "开市", "作灶", "伐木", "作梁"]
  },
  "6-53": {
    yi: ["祭祀", "馀事勿取", "安碓磑", "结网"],
    ji: ["嫁娶", "安葬"]
  },
  "6-54": {
    yi: ["出行", "移徙", "纳采", "立券", "交易", "入宅", "开市", "订盟", "祈福", "安床", "造车器", "安葬", "安门", "祭祀", "出火", "求嗣", "谢土"],
    ji: ["动土", "栽种", "盖屋", "作灶", "开光"]
  },
  "6-55": {
    yi: ["嫁娶", "解除", "移徙", "纳采", "入宅", "裁衣", "订盟", "动土", "祈福", "栽种", "安床", "安葬", "修造", "拆卸", "放水", "修坟", "移柩", "冠笄", "安香", "开光", "立碑", "启鑽", "求嗣", "竖柱", "塑绘", "谢土", "斋醮"],
    ji: ["赴任"]
  },
  "6-56": {
    yi: ["解除", "沐浴", "安葬", "祭祀", "移柩", "馀事勿取", "破土", "谢土"],
    ji: ["嫁娶", "入宅", "开光", "上梁", "斋醮"]
  },
  "6-57": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "开市", "动土", "祈福", "安葬", "祭祀", "破土"],
    ji: ["安门"]
  },
  "6-58": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "立券", "交易", "入宅", "纳财", "订盟", "祈福", "安床", "安葬", "挂匾", "祭祀", "修造", "拆卸", "入殓", "成服", "出火", "除服", "进人口", "开光", "启鑽", "求嗣"],
    ji: ["动土", "掘井", "破土"]
  },
  "6-59": {
    yi: ["扫舍", "沐浴", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "6-6": {
    yi: ["嫁娶", "置产", "修饰垣墙", "祭祀", "冠笄"],
    ji: ["动土", "经络", "盖屋", "作灶", "探病"]
  },
  "6-7": {
    yi: ["嫁娶", "会亲友", "纳采", "立券", "交易", "入宅", "纳财", "裁衣", "祈福", "安床", "安葬", "挂匾", "祭祀", "修造", "造仓", "放水", "入殓", "移柩", "安碓磑", "安香", "求嗣", "谢土", "合帐"],
    ji: ["栽种", "伐木"]
  },
  "6-8": {
    yi: ["祈福", "沐浴", "纳畜", "安葬", "祭祀", "入殓", "破土", "求嗣", "斋醮"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "安床"]
  },
  "6-9": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "栽种", "安床", "安葬", "安门", "挂匾", "祭祀", "拆卸", "出火", "进人口", "开光", "破土", "求嗣", "上梁"],
    ji: [""]
  },
  "7-0": {
    yi: ["解除", "纳采", "动土", "祈福", "安葬", "祭祀", "破土"],
    ji: ["嫁娶", "移徙", "入宅"]
  },
  "7-1": {
    yi: ["安葬", "祭祀", "入殓", "移柩", "馀事勿取", "捕捉", "成服", "除服", "破土"],
    ji: ["嫁娶", "交易", "入宅", "开市"]
  },
  "7-10": {
    yi: ["出行", "解除", "裁衣", "安葬", "祭祀", "入殓", "移柩", "成服", "除服", "开光", "破土", "启鑽", "塑绘"],
    ji: ["嫁娶", "入宅", "动土", "架马", "修造", "拆卸", "出火", "伐木", "开柱眼", "上梁"]
  },
  "7-11": {
    yi: ["出行", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "盖屋", "安门", "祭祀", "修造", "拆卸", "起基", "冠笄", "安香", "出火", "开池", "上梁", "竖柱", "斋醮", "定磉"],
    ji: ["嫁娶", "开市", "安葬", "合寿木"]
  },
  "7-12": {
    yi: ["解除", "整手足甲", "沐浴", "安葬", "祭祀", "入殓", "移柩", "破土", "启鑽"],
    ji: ["嫁娶", "移徙", "交易", "入宅", "开市", "栽种", "安门", "作灶"]
  },
  "7-13": {
    yi: ["解除", "安葬", "祭祀", "入殓", "捕捉", "结网", "破土", "普渡", "畋猎"],
    ji: ["嫁娶", "交易", "入宅", "开市"]
  },
  "7-14": {
    yi: ["解除", "动土", "安葬", "拆卸", "起基", "修坟", "移柩", "开光", "立碑", "破土", "启鑽", "上梁"],
    ji: ["嫁娶", "出行", "移徙", "置产", "入宅", "安床", "祭祀", "作灶", "出火", "进人口"]
  },
  "7-15": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "订盟", "祈福", "安床", "纳畜", "安葬", "祭祀", "起基", "安香", "捕捉", "出火", "开光", "纳婿", "求嗣", "上梁", "竖柱", "造庙", "斋醮"],
    ji: ["开市", "合寿木", "掘井", "破土"]
  },
  "7-16": {
    yi: ["解除", "安床", "纳畜", "安葬", "修造", "拆卸", "入殓", "开光", "启鑽"],
    ji: ["嫁娶", "移徙", "入宅", "开市", "动土", "栽种", "分居", "作灶", "安香", "出火", "掘井", "破土"]
  },
  "7-17": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "盖屋", "安门", "祭祀", "修造", "起基", "安碓磑", "安香", "出火", "合嵴", "求嗣", "上梁", "斋醮"],
    ji: ["出行", "安葬", "行丧", "掘井", "破土"]
  },
  "7-18": {
    yi: ["嫁娶", "移徙", "动土", "祈福", "安床", "祭祀", "修造", "进人口", "开光", "求嗣"],
    ji: ["出行", "入宅", "开市", "栽种", "安葬", "安门", "作灶", "掘井"]
  },
  "7-19": {
    yi: ["嫁娶", "会亲友", "出行", "入学", "纳采", "习艺", "订盟", "安葬", "牧养", "入殓", "移柩", "捕捉", "进人口", "启鑽"],
    ji: ["入宅", "开市", "动土", "盖屋", "开光"]
  },
  "7-2": {
    yi: ["会亲友", "沐浴", "安葬", "拆卸", "起基", "移柩", "冠笄", "捕捉", "成服", "除服", "开光", "启鑽", "塑绘"],
    ji: ["嫁娶", "入宅", "祭祀", "作灶"]
  },
  "7-20": {
    yi: ["嫁娶", "移徙", "理发", "入学", "赴任", "裁衣", "动土", "祈福", "架马", "安葬", "祭祀", "修造", "拆卸", "放水", "起基", "入殓", "移柩", "冠笄", "出火", "伐木", "开光", "求嗣", "塑绘", "谢土", "斋醮", "作梁", "定磉", "合帐"],
    ji: ["入宅", "安门"]
  },
  "7-21": {
    yi: ["解除", "纳采", "订盟", "祈福", "安葬", "祭祀", "求医", "取渔", "治病", "起基", "入殓", "开光", "启鑽", "求嗣", "谢土", "造船", "斋醮", "定磉"],
    ji: ["开市", "动土", "掘井", "开池"]
  },
  "7-22": {
    yi: ["嫁娶", "会亲友", "解除", "裁衣", "动土", "祈福", "安床", "架马", "祭祀", "修造", "放水", "起基", "冠笄", "伐木", "进人口", "开光", "求嗣", "上梁", "竖柱", "作梁", "合帐"],
    ji: [""]
  },
  "7-23": {
    yi: ["沐浴", "祭祀", "取渔", "馀事勿取", "捕捉", "结网", "畋猎"],
    ji: ["嫁娶", "交易", "开市", "安葬", "行丧"]
  },
  "7-24": {
    yi: ["解除", "理发", "安葬", "祭祀", "入殓", "破土"],
    ji: ["嫁娶", "移徙", "置产", "入宅", "开市", "安门", "作灶", "出火", "斋醮"]
  },
  "7-25": {
    yi: ["纳畜", "安葬", "祭祀", "牧养", "入殓", "移柩", "捕捉", "成服", "除服", "破土", "启鑽", "畋猎"],
    ji: ["嫁娶", "纳采", "入宅", "开市", "订盟"]
  },
  "7-26": {
    yi: ["解除", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "7-27": {
    yi: ["会亲友", "立券", "交易", "纳财", "开市", "习艺", "经络", "祈福", "栽种", "安机械", "开厕", "安葬", "祭祀", "牧养", "求医", "治病", "出火", "结网", "开池", "破土", "启鑽", "求嗣", "造庙", "斋醮", "畋猎"],
    ji: ["嫁娶", "伐木", "掘井", "开光", "作梁"]
  },
  "7-28": {
    yi: ["解除", "整手足甲", "理发", "祭祀", "进人口", "针灸"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "开市", "动土", "安葬", "修造", "作灶", "掘井", "开池", "破土", "上梁", "造船"]
  },
  "7-29": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "裁衣", "动土", "安床", "祭祀", "修造", "拆卸", "放水", "冠笄", "安香", "捕捉", "伐木", "结网", "进人口", "开光", "上梁", "竖柱", "塑绘", "畋猎"],
    ji: ["出行", "开市", "安葬", "修坟"]
  },
  "7-3": {
    yi: ["嫁娶", "出行", "动土", "祈福", "安床", "纳畜", "祭祀", "修造", "拆卸", "入殓", "开光", "破土", "求嗣", "上梁"],
    ji: ["移徙", "理发", "交易", "入宅", "开市", "作灶", "伐木", "掘井"]
  },
  "7-30": {
    yi: ["嫁娶", "出行", "解除", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "安床", "纳畜", "安葬", "祭祀", "拆卸", "出火", "开光", "破土", "谢土"],
    ji: ["交易", "开市", "盖屋", "安门", "作灶", "伐木", "上梁"]
  },
  "7-31": {
    yi: ["嫁娶", "解除", "移徙", "纳采", "入宅", "裁衣", "订盟", "祈福", "安床", "安葬", "安门", "祭祀", "取渔", "入殓", "移柩", "冠笄", "安香", "捕捉", "酬神", "出火", "伐木", "启鑽", "合帐"],
    ji: ["开市", "动土", "栽种", "作灶"]
  },
  "7-32": {
    yi: ["嫁娶", "出行", "解除", "移徙", "入宅", "祈福", "栽种", "安葬", "祭祀", "出火", "伐木", "开光", "破土", "求嗣", "谢土"],
    ji: ["交易", "纳财", "开市", "安床", "盖屋", "作灶", "上梁", "造船"]
  },
  "7-33": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "祈福", "祭祀", "求医"],
    ji: ["开市", "动土", "破土"]
  },
  "7-34": {
    yi: ["嫁娶", "出行", "解除", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "栽种", "安床", "安葬", "挂匾", "祭祀", "修造", "拆卸", "入殓", "移柩", "出火", "进人口", "开光", "破土", "求嗣", "谢土"],
    ji: ["立券", "开市", "合寿木", "造船"]
  },
  "7-35": {
    yi: ["出行", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "祭祀", "修造"],
    ji: ["开市", "安葬"]
  },
  "7-36": {
    yi: ["解除", "整手足甲", "祈福", "安床", "沐浴", "安葬", "祭祀", "入殓", "移柩", "破土", "启鑽", "谢土"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "开市", "安门", "作灶", "出火", "伐木", "斋醮"]
  },
  "7-37": {
    yi: ["安葬", "入殓", "捕捉", "结网", "破土"],
    ji: ["嫁娶", "入宅"]
  },
  "7-38": {
    yi: ["解除", "动土", "安葬", "安门", "牧养", "修造", "拆卸", "修坟", "移柩", "开光", "破土", "竖柱"],
    ji: ["嫁娶", "移徙", "入宅", "开市", "祈福", "安床", "祭祀", "探病", "出火"]
  },
  "7-39": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "安葬", "祭祀", "破土"],
    ji: ["开市", "赴任"]
  },
  "7-4": {
    yi: ["嫁娶", "纳采", "订盟", "安床", "安葬", "祭祀", "入殓", "移柩", "成服", "除服", "进人口", "开光", "立碑", "启鑽", "塑绘"],
    ji: ["交易", "开市", "作灶", "破土"]
  },
  "7-40": {
    yi: ["嫁娶", "出行", "解除", "移徙", "纳采", "入宅", "订盟", "栽种", "安葬", "祭祀", "修造", "拆卸", "入殓", "出火", "伐木", "开光"],
    ji: ["交易", "开市", "动土", "安门", "作灶", "破土"]
  },
  "7-41": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "祭祀", "修造"],
    ji: ["开市", "安葬"]
  },
  "7-42": {
    yi: ["整手足甲", "理发", "沐浴", "安葬", "入殓", "修坟", "捕捉", "成服", "除服", "立碑", "破土", "启鑽", "谢土", "畋猎"],
    ji: ["嫁娶", "纳采", "开市", "订盟", "盖屋", "安门", "上梁", "斋醮"]
  },
  "7-43": {
    yi: ["嫁娶", "出行", "解除", "移徙", "入宅", "动土", "祈福", "栽种", "安床", "纳畜", "安葬", "祭祀", "拆卸", "出火", "破土", "启鑽", "上梁"],
    ji: ["理发", "立券", "开市", "作灶"]
  },
  "7-44": {
    yi: ["出行", "移徙", "入宅", "动土", "祈福", "安葬", "修造", "破土", "斋醮"],
    ji: ["嫁娶", "纳采", "开市", "安床", "开光"]
  },
  "7-45": {
    yi: ["解除", "入宅", "祈福", "安床", "纳畜", "安葬", "安门", "祭祀", "修造", "拆卸", "出火", "开光", "启鑽", "求嗣"],
    ji: ["交易", "纳财", "开市", "动土", "挂匾", "伐木", "掘井", "破土"]
  },
  "7-46": {
    yi: ["嫁娶", "会亲友", "解除", "纳采", "订盟", "动土", "祈福", "纳畜", "安葬", "祭祀", "牧养", "求医", "治病", "入殓", "捕捉", "开光", "破土", "斋醮"],
    ji: ["移徙", "入宅", "盖屋", "架马"]
  },
  "7-47": {
    yi: ["出行", "移徙", "入宅", "动土", "祈福", "安床", "祭祀", "修造", "拆卸", "起基", "出火", "伐木", "开光", "求嗣"],
    ji: ["嫁娶", "交易", "开市", "安葬", "修坟", "行丧"]
  },
  "7-48": {
    yi: ["理发", "沐浴", "安葬", "入殓", "移柩", "捕捉", "启鑽"],
    ji: ["嫁娶", "入宅", "动土", "作灶", "出火", "破土", "上梁"]
  },
  "7-49": {
    yi: ["安葬", "祭祀", "入殓", "移柩", "馀事勿取", "破土", "塞穴"],
    ji: ["诸事不宜"]
  },
  "7-5": {
    yi: ["嫁娶", "会亲友", "祈福", "安床", "祭祀", "冠笄", "捕捉", "伐木", "进人口", "掘井", "开柱眼", "求嗣", "斋醮", "作梁", "畋猎"],
    ji: ["安葬", "开生坟", "行丧", "破土"]
  },
  "7-50": {
    yi: ["沐浴", "安葬", "入殓", "捕捉", "成服", "除服", "破土", "启鑽"],
    ji: ["嫁娶", "入宅", "开市", "安床", "祭祀", "探病", "上梁"]
  },
  "7-51": {
    yi: ["安葬", "祭祀", "开生坟", "入殓", "移柩", "成服", "除服", "破土", "启鑽"],
    ji: ["馀事勿取"]
  },
  "7-52": {
    yi: ["嫁娶", "解除", "移徙", "纳采", "订盟", "祈福", "安床", "安葬", "祭祀", "求医", "治病", "入殓", "移柩", "捕捉", "成服", "除服", "伐木", "结网", "开光", "立碑", "塑绘", "谢土", "作梁", "畋猎"],
    ji: ["开市", "动土", "破土", "造庙"]
  },
  "7-53": {
    yi: ["解除", "祭祀", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "7-54": {
    yi: ["嫁娶", "出行", "移徙", "理发", "入宅", "裁衣", "沐浴", "安葬", "祭祀", "放水", "入殓", "移柩", "捕捉", "成服", "除服", "启鑽", "畋猎"],
    ji: ["开市", "动土", "盖屋", "破土"]
  },
  "7-55": {
    yi: ["嫁娶", "动土", "安葬", "入殓", "移柩", "破土"],
    ji: ["入宅", "开市", "裁衣", "安床", "作灶", "上梁"]
  },
  "7-56": {
    yi: ["解除", "扫舍", "理发", "沐浴", "安葬", "祭祀", "取渔", "入殓", "修坟", "移柩", "捕捉", "成服", "除服", "结网", "立碑", "启鑽", "谢土", "畋猎"],
    ji: ["嫁娶", "入宅", "安床", "作灶"]
  },
  "7-57": {
    yi: ["解除", "扫舍", "整手足甲", "安葬", "祭祀", "取渔", "入殓", "移柩", "捕捉", "成服", "除服", "启鑽", "谢土", "斋醮", "畋猎"],
    ji: ["动土", "破土"]
  },
  "7-58": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "动土", "安葬", "求医", "修造", "治病", "破土"],
    ji: ["开市", "开光"]
  },
  "7-59": {
    yi: ["沐浴", "祭祀", "取渔", "馀事勿取", "捕捉", "结网", "畋猎"],
    ji: ["嫁娶", "开市", "安葬", "行丧", "启鑽"]
  },
  "7-6": {
    yi: ["嫁娶", "会亲友", "出行", "纳采", "赴任", "裁衣", "订盟", "动土", "祈福", "栽种", "安床", "沐浴", "安葬", "安门", "祭祀", "修造", "拆卸", "入殓", "移柩", "捕捉", "伐木", "破土", "上梁", "竖柱", "谢土", "斋醮"],
    ji: ["入宅", "开市", "盖屋", "作灶"]
  },
  "7-7": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "动土", "祈福", "安葬", "祭祀", "修造", "破土"],
    ji: ["入宅", "开市", "斋醮"]
  },
  "7-8": {
    yi: ["扫舍", "纳采", "裁衣", "订盟", "动土", "祈福", "沐浴", "安葬", "祭祀", "修造", "拆卸", "起基", "移柩", "出火", "伐木", "开柱眼", "上梁", "谢土", "斋醮", "合帐"],
    ji: ["立券", "开市", "安床", "作灶"]
  },
  "7-9": {
    yi: ["出行", "纳采", "祈福", "盖屋", "安葬", "安门", "祭祀", "起基", "入殓", "求嗣", "斋醮", "定磉"],
    ji: ["嫁娶", "纳财", "开市", "出火"]
  },
  "8-0": {
    yi: ["破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["移徙", "入宅", "出货财", "开仓"]
  },
  "8-1": {
    yi: ["破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-10": {
    yi: ["解除", "沐浴", "破屋", "祭祀", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["开市", "祈福", "安葬", "斋醮"]
  },
  "8-11": {
    yi: ["解除", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-12": {
    yi: ["沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "移徙", "入宅"]
  },
  "8-13": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-14": {
    yi: ["沐浴", "破屋", "馀事勿取", "坏垣"],
    ji: ["开市", "斋醮"]
  },
  "8-15": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-16": {
    yi: ["解除", "沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "开市"]
  },
  "8-17": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-18": {
    yi: ["沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "出行", "移徙", "入宅", "盖屋", "探病"]
  },
  "8-19": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-2": {
    yi: ["破屋", "治病", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "纳采", "入宅", "订盟", "祈福", "安葬"]
  },
  "8-20": {
    yi: ["解除", "扫舍", "沐浴", "破屋", "祭祀", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["入宅", "开市", "安葬"]
  },
  "8-21": {
    yi: ["破屋", "祭祀", "治病", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-22": {
    yi: ["解除", "沐浴", "破屋", "祭祀", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "交易", "入宅", "开市", "安葬"]
  },
  "8-23": {
    yi: ["解除", "沐浴", "破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-24": {
    yi: ["破屋", "求医", "治病", "馀事勿取", "坏垣", "畋猎"],
    ji: ["嫁娶", "入宅"]
  },
  "8-25": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-26": {
    yi: ["破屋", "治病", "馀事勿取", "坏垣"],
    ji: ["安葬", "行丧"]
  },
  "8-27": {
    yi: ["破屋", "祭祀", "治病", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-28": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-29": {
    yi: ["破屋", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "安葬"]
  },
  "8-3": {
    yi: ["沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["出行", "移徙", "入宅", "栽种"]
  },
  "8-30": {
    yi: ["破屋", "祭祀", "求医", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-31": {
    yi: ["解除", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["开市", "动土", "破土"]
  },
  "8-32": {
    yi: ["破屋", "求医"],
    ji: ["诸事不宜"]
  },
  "8-33": {
    yi: ["破屋", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "开光"]
  },
  "8-34": {
    yi: ["解除", "祭祀", "求医", "治病", "馀事勿取"],
    ji: ["诸事不宜"]
  },
  "8-35": {
    yi: ["解除", "沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["安葬", "开光"]
  },
  "8-36": {
    yi: [""],
    ji: ["诸事不宜"]
  },
  "8-37": {
    yi: ["解除", "破屋", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "安葬"]
  },
  "8-38": {
    yi: ["沐浴", "破屋", "治病", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-39": {
    yi: ["破屋", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["移徙", "入宅"]
  },
  "8-4": {
    yi: ["沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "出行", "入宅", "安葬", "上梁"]
  },
  "8-40": {
    yi: ["解除", "破屋", "祭祀", "坏垣"],
    ji: ["馀事勿取"]
  },
  "8-41": {
    yi: ["解除", "破屋", "祭祀", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "安葬"]
  },
  "8-42": {
    yi: ["破屋", "治病", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-43": {
    yi: ["破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "开市", "斋醮"]
  },
  "8-44": {
    yi: ["解除", "扫舍", "破屋", "祭祀", "治病", "坏垣"],
    ji: ["馀事勿取"]
  },
  "8-45": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "移徙", "入宅", "开市"]
  },
  "8-46": {
    yi: ["解除", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-47": {
    yi: ["解除", "沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["安葬", "行丧"]
  },
  "8-48": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-49": {
    yi: ["破屋", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "出行"]
  },
  "8-5": {
    yi: ["解除", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-50": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-51": {
    yi: [""],
    ji: ["探病", "馀事勿取"]
  },
  "8-52": {
    yi: ["解除", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-53": {
    yi: ["破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "安葬"]
  },
  "8-54": {
    yi: ["沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-55": {
    yi: ["破屋", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "开市", "安葬"]
  },
  "8-56": {
    yi: ["破屋", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "开市"]
  },
  "8-57": {
    yi: ["破屋", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-58": {
    yi: ["解除", "沐浴", "破屋", "祭祀", "求医", "治病", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "开市"]
  },
  "8-59": {
    yi: ["破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-6": {
    yi: ["破屋", "治病", "馀事勿取", "坏垣"],
    ji: ["移徙", "入宅"]
  },
  "8-7": {
    yi: ["解除", "破屋", "馀事勿取", "坏垣"],
    ji: ["诸事不宜"]
  },
  "8-8": {
    yi: ["解除", "扫舍", "理发", "沐浴", "破屋", "祭祀", "馀事勿取", "坏垣"],
    ji: ["嫁娶", "安葬"]
  },
  "8-9": {
    yi: ["破屋", "求医", "治病", "坏垣"],
    ji: ["诸事不宜"]
  },
  "9-0": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "动土", "安葬", "祭祀", "破土", "上梁"],
    ji: ["祈福", "斋醮"]
  },
  "9-1": {
    yi: ["出行", "动土", "安床", "开厕", "祭祀", "修造", "造畜稠", "放水", "结网", "掘井", "开池", "开光", "破土", "塑绘", "斋醮"],
    ji: ["入宅", "出火"]
  },
  "9-10": {
    yi: ["嫁娶", "出行", "解除", "移徙", "纳采", "入宅", "赴任", "订盟", "动土", "祈福", "安床", "安机械", "安葬", "祭祀", "造仓", "拆卸", "入殓", "移柩", "安香", "进人口", "立碑", "破土", "求嗣", "上梁", "谢土"],
    ji: ["出货财", "开光"]
  },
  "9-11": {
    yi: ["沐浴", "取渔", "捕捉", "结网", "畋猎"],
    ji: ["嫁娶", "入宅", "安葬", "祭祀", "作灶"]
  },
  "9-12": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "移徙", "入宅", "动土", "祈福", "栽种", "安床", "纳畜", "安门", "祭祀", "牧养", "修造", "拆卸", "出火", "进人口", "开光", "求嗣", "上梁", "竖柱"],
    ji: [""]
  },
  "9-13": {
    yi: ["嫁娶", "出行", "交易", "裁衣", "祈福", "安机械", "祭祀", "放水", "掘井", "开池", "开光", "求嗣", "塑绘", "斋醮", "合帐"],
    ji: ["理发", "安葬", "作灶", "行丧", "造桥"]
  },
  "9-14": {
    yi: ["嫁娶", "出行", "移徙", "理发", "立券", "交易", "入宅", "开市", "动土", "栽种", "安床", "挂匾", "修造", "拆卸", "出火", "开光", "作梁"],
    ji: ["纳畜", "祭祀", "伐木"]
  },
  "9-15": {
    yi: ["纳采", "立券", "入宅", "开市", "订盟", "祈福", "安葬", "挂匾", "祭祀", "安香", "出火", "启鑽", "造桥"],
    ji: ["嫁娶", "动土", "安床", "掘井", "破土"]
  },
  "9-16": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "动土", "祈福", "栽种", "安床", "挂匾", "修造", "拆卸", "入殓", "成服", "出火", "除服", "伐木", "进人口", "开光", "破土", "求嗣", "上梁"],
    ji: [""]
  },
  "9-17": {
    yi: ["会亲友", "纳采", "立券", "交易", "纳财", "订盟", "栽种", "纳畜", "牧养"],
    ji: ["嫁娶", "入宅", "开市", "祈福", "安葬"]
  },
  "9-18": {
    yi: ["嫁娶", "出行", "解除", "移徙", "立券", "交易", "入宅", "纳财", "开市", "动土", "栽种", "安床", "纳畜", "挂匾", "祭祀", "修造", "拆卸", "出火", "开光"],
    ji: ["安葬", "探病"]
  },
  "9-19": {
    yi: ["理发", "立券", "交易", "纳财", "安床", "放水", "冠笄", "出火", "结网", "掘井", "开池", "畋猎"],
    ji: ["动土", "安葬", "安门", "行丧", "成服", "破土"]
  },
  "9-2": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "开市", "动土", "安葬", "破土", "上梁"],
    ji: ["祈福", "祭祀"]
  },
  "9-20": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "入宅", "开市", "动土", "安葬", "修造", "拆卸", "移柩", "成服", "出火", "除服", "开光", "破土", "启鑽"],
    ji: ["祈福", "安床", "纳畜", "伐木"]
  },
  "9-21": {
    yi: ["嫁娶", "入宅", "开市", "动土", "盖屋", "安葬", "祭祀", "修造", "拆卸", "起基", "入殓", "移柩", "冠笄", "成服", "除服", "开池", "破土", "塞穴", "上梁"],
    ji: ["栽种", "安床", "治病", "作灶"]
  },
  "9-22": {
    yi: ["嫁娶", "出行", "移徙", "立券", "交易", "开市", "动土", "安床", "祭祀", "修造", "入殓", "移柩", "冠笄", "进人口", "破土"],
    ji: ["安葬", "作灶", "开光", "斋醮"]
  },
  "9-23": {
    yi: [""],
    ji: ["诸事不宜"]
  },
  "9-24": {
    yi: ["嫁娶", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "栽种", "安床", "造车器", "安葬", "挂匾", "祭祀", "修造", "拆卸", "入殓", "成服", "出火", "除服", "进人口", "开光", "破土", "求嗣"],
    ji: ["立券", "开市"]
  },
  "9-25": {
    yi: ["嫁娶", "出行", "经络", "安床", "安机械", "祭祀", "治病", "入殓", "结网", "开光", "破土", "塞穴", "塑绘"],
    ji: ["开市", "安门", "作灶", "掘井"]
  },
  "9-26": {
    yi: ["嫁娶", "出行", "入学", "纳采", "立券", "交易", "纳财", "开市", "出货财", "订盟", "动土", "栽种", "开仓", "纳畜", "安葬", "牧养", "开光", "立碑", "破土", "启鑽"],
    ji: ["移徙", "入宅", "祭祀", "作灶", "谢土"]
  },
  "9-27": {
    yi: ["嫁娶", "出行", "立券", "交易", "入宅", "纳财", "开市", "祈福", "安葬", "入殓", "移柩", "冠笄", "成服", "除服", "雕刻", "开柱眼", "启鑽", "造桥", "斋醮"],
    ji: ["订盟", "动土", "安床", "开池", "破土"]
  },
  "9-28": {
    yi: ["嫁娶", "出行", "移徙", "理发", "纳采", "入宅", "订盟", "动土", "栽种", "安床", "纳畜", "安葬", "挂匾", "祭祀", "修造", "拆卸", "入殓", "成服", "出火", "除服", "进人口", "开光", "破土", "作梁"],
    ji: ["开市", "掘井", "开渠", "造船", "造桥"]
  },
  "9-29": {
    yi: ["嫁娶", "会亲友", "纳采", "纳财", "订盟", "动土", "安床", "修造", "拆卸", "起基", "纳婿", "上梁", "竖柱"],
    ji: ["出行", "祈福", "安葬", "作灶"]
  },
  "9-3": {
    yi: ["嫁娶", "出行", "解除", "移徙", "立券", "交易", "入宅", "开市", "祈福", "栽种", "安床", "安葬", "祭祀", "安香", "出火", "伐木", "开光", "求嗣"],
    ji: ["理发", "动土", "作灶", "掘井", "开池", "破土"]
  },
  "9-30": {
    yi: ["嫁娶", "会亲友", "出行", "解除", "移徙", "入学", "纳采", "入宅", "纳财", "开市", "订盟", "动土", "祈福", "安床", "安门", "祭祀", "牧养", "修造", "造畜稠", "起基", "雕刻", "开池", "造庙"],
    ji: ["出货财", "开仓", "盖屋", "上梁", "造船"]
  },
  "9-31": {
    yi: ["出行", "移徙", "入宅", "祈福", "安床", "安机械", "祭祀", "移柩", "冠笄", "安香", "成服", "除服", "启鑽", "斋醮"],
    ji: ["栽种", "安门", "治病", "作灶", "开光"]
  },
  "9-32": {
    yi: ["嫁娶", "移徙", "纳采", "立券", "交易", "入宅", "纳财", "开市", "裁衣", "订盟", "动土", "栽种", "盖屋", "安葬", "安门", "牧养", "修造", "起基", "入殓", "安香", "成服", "出火", "除服", "掘井", "开池", "开光", "立碑", "破土", "畋猎"],
    ji: ["祈福", "安床", "祭祀", "谢土", "造庙"]
  },
  "9-33": {
    yi: ["嫁娶", "出行", "解除", "纳采", "入宅", "纳财", "订盟", "动土", "祈福", "沐浴", "安葬", "安门", "修造", "放水", "移柩", "安香", "开光", "破土", "求嗣", "上梁", "竖柱", "塑绘", "谢土", "斋醮"],
    ji: ["安床", "作灶"]
  },
  "9-34": {
    yi: ["纳采", "立券", "交易", "动土", "安床", "安机械", "安葬", "移柩", "立碑", "破土"],
    ji: ["嫁娶", "作灶", "开光"]
  },
  "9-35": {
    yi: ["沐浴", "取渔", "结网"],
    ji: ["嫁娶", "入宅", "安葬"]
  },
  "9-36": {
    yi: ["嫁娶", "出行", "解除", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "栽种", "安床", "纳畜", "安葬", "祭祀", "拆卸", "修坟", "出火", "开光", "破土", "求嗣", "谢土"],
    ji: ["开市", "经络", "作灶"]
  },
  "9-37": {
    yi: ["嫁娶", "纳采", "订盟", "祈福", "安葬", "祭祀", "入殓", "破土"],
    ji: ["开市", "开光"]
  },
  "9-38": {
    yi: ["嫁娶", "会亲友", "移徙", "立券", "入宅", "开市", "出货财", "经络", "栽种", "安床", "开仓", "安机械", "纳畜", "安葬", "安门", "挂匾", "牧养", "拆卸", "入殓", "移柩", "开池", "立碑", "破土", "启鑽"],
    ji: ["祈福", "祭祀", "探病", "谢土", "造桥"]
  },
  "9-39": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "开市", "订盟", "祈福", "安葬", "祭祀", "启鑽"],
    ji: ["动土", "破土"]
  },
  "9-4": {
    yi: ["嫁娶", "出行", "解除", "交易", "入宅", "开市", "订盟", "安床", "挂匾", "祭祀", "拆卸", "起基", "入殓", "移柩", "成服", "除服", "开光", "开柱眼", "破土", "塑绘", "谢土"],
    ji: ["盖屋", "冠笄", "掘井", "造桥"]
  },
  "9-40": {
    yi: ["嫁娶", "出行", "移徙", "纳采", "入宅", "订盟", "动土", "祈福", "安床", "祭祀", "修造", "拆卸", "放水", "移柩", "成服", "出火", "除服", "合嵴", "进人口", "掘井", "开光", "破土", "求嗣", "上梁", "谢土"],
    ji: ["开市", "开仓", "安葬", "安门"]
  },
  "9-41": {
    yi: ["会亲友", "纳采", "纳财", "订盟", "安机械", "牧养"],
    ji: ["祈福", "安葬"]
  },
  "9-42": {
    yi: ["扫舍", "安葬", "入殓", "移柩", "馀事勿取", "成服", "除服", "立碑", "破土", "启鑽"],
    ji: ["嫁娶", "入宅", "动土", "祭祀", "修造"]
  },
  "9-43": {
    yi: ["入学", "交易", "订盟", "动土", "祈福", "祭祀", "修造", "放水", "起基", "冠笄", "伐木", "开池", "开光", "求嗣", "斋醮"],
    ji: ["理发", "栽种", "安门", "作灶", "造庙", "造桥"]
  },
  "9-44": {
    yi: ["立券", "交易", "纳财", "开市", "出货财", "栽种", "开仓", "沐浴", "纳畜", "安葬", "牧养", "入殓", "破土", "畋猎"],
    ji: ["嫁娶", "入宅", "祈福", "安床", "造船"]
  },
  "9-45": {
    yi: ["出行", "移徙", "入宅", "动土", "祈福", "安葬", "挂匾", "祭祀", "修造", "拆卸", "入殓", "出火", "开池", "开光", "破土", "启鑽", "求嗣", "上梁"],
    ji: ["嫁娶", "安床", "作灶"]
  },
  "9-46": {
    yi: ["嫁娶", "会亲友", "出行", "动土", "祭祀", "修造", "入殓", "冠笄", "破土"],
    ji: ["成服", "除服", "开光", "塑绘", "造桥"]
  },
  "9-47": {
    yi: ["扫舍", "馀事勿取", "塞穴"],
    ji: ["诸事不宜"]
  },
  "9-48": {
    yi: ["扫舍", "沐浴", "馀事勿取"],
    ji: ["嫁娶", "开市", "作灶", "斋醮"]
  },
  "9-49": {
    yi: ["立券", "交易", "纳财", "开市", "动土", "经络", "安床", "开厕", "祭祀", "修造", "放水", "结网", "开池", "破土"],
    ji: ["嫁娶", "移徙", "词讼", "栽种", "安门", "作灶", "造桥"]
  },
  "9-5": {
    yi: ["会亲友", "纳财", "经络", "安床", "安门", "祭祀", "牧养", "放水", "冠笄", "割蜜", "进人口", "求嗣", "畋猎"],
    ji: ["嫁娶", "纳采", "入宅", "订盟", "祈福", "安葬", "斋醮"]
  },
  "9-50": {
    yi: ["嫁娶", "会亲友", "出行", "移徙", "纳采", "立券", "交易", "入宅", "纳财", "开市", "订盟", "安床", "盖屋", "安葬", "挂匾", "作灶", "拆卸", "起基", "入殓", "移柩", "安香", "出火", "立碑", "破土", "启鑽"],
    ji: ["祈福", "开仓", "牧养", "掘井", "上梁"]
  },
  "9-51": {
    yi: ["安葬", "祭祀", "入殓", "移柩", "馀事勿取", "成服", "除服", "结网", "启鑽"],
    ji: ["诸事不宜"]
  },
  "9-52": {
    yi: ["移徙", "纳采", "立券", "入宅", "订盟", "动土", "祈福", "安门", "祭祀", "修造", "起基", "安香", "出火", "开池", "破土", "上梁", "竖柱", "定磉"],
    ji: ["嫁娶", "安葬", "作灶", "造船", "造庙", "造桥"]
  },
  "9-53": {
    yi: ["嫁娶", "会亲友", "纳采", "纳财", "纳畜", "牧养", "结网", "进人口", "求嗣"],
    ji: ["出行", "理发", "安葬", "安门", "作灶", "伐木", "上梁"]
  },
  "9-54": {
    yi: ["嫁娶", "移徙", "纳采", "裁衣", "订盟", "安床", "架马", "开厕", "安葬", "祭祀", "作灶", "入殓", "移柩", "冠笄", "成服", "除服", "伐木", "结网", "开池", "开柱眼", "启鑽", "作梁", "定磉", "畋猎"],
    ji: ["动土", "盖屋", "破土", "造船"]
  },
  "9-55": {
    yi: ["动土", "祈福", "安床", "架马", "开厕", "祭祀", "入殓", "冠笄", "成服", "除服", "伐木", "结网", "开池", "求嗣"],
    ji: ["栽种", "安门", "治病", "作灶"]
  },
  "9-56": {
    yi: ["会亲友", "扫舍", "入学", "纳采", "裁衣", "订盟", "栽种", "纳畜", "安葬", "挂匾", "祭祀", "造仓", "拆卸", "入殓", "修坟", "出火", "结网", "掘井", "开池", "立碑", "破土", "求嗣", "塑绘"],
    ji: ["嫁娶", "祈福", "安床", "谢土", "造庙"]
  },
  "9-57": {
    yi: ["沐浴", "安葬", "祭祀", "合寿木", "开生坟", "入殓", "移柩", "成服", "除服", "破土", "斋醮"],
    ji: ["嫁娶", "会亲友", "入宅", "开市", "安床", "作灶", "上梁"]
  },
  "9-58": {
    yi: ["出行", "纳采", "裁衣", "订盟", "动土", "安床", "安葬", "祭祀", "取渔", "作灶", "入殓", "移柩", "冠笄", "结网", "进人口", "破土", "合帐", "畋猎"],
    ji: ["造庙", "作梁"]
  },
  "9-59": {
    yi: ["扫舍", "沐浴", "取渔", "馀事勿取", "结网", "塞穴", "畋猎"],
    ji: ["祈福", "安葬"]
  },
  "9-6": {
    yi: ["出行", "解除", "移徙", "纳采", "赴任", "裁衣", "订盟", "动土", "祈福", "栽种", "安床", "纳畜", "安葬", "祭祀", "修造", "拆卸", "入殓", "移柩", "冠笄", "成服", "除服", "伐木", "开光", "破土", "启鑽", "上梁", "竖柱", "塑绘", "斋醮"],
    ji: ["盖屋", "治病"]
  },
  "9-7": {
    yi: ["出行", "理发", "安床", "架马", "开厕", "祭祀", "入殓", "修坟", "移柩", "成服", "除服", "伐木", "开光", "开柱眼", "立碑", "破土", "启鑽", "塑绘", "作梁", "畋猎"],
    ji: ["开市", "安葬", "安门", "作灶", "造桥"]
  },
  "9-8": {
    yi: ["嫁娶", "出行", "纳采", "订盟", "安葬", "入殓", "移柩", "成服", "除服", "开光", "立碑", "纳婿", "启鑽", "塑绘"],
    ji: ["入宅", "安床"]
  },
  "9-9": {
    yi: ["出行", "移徙", "纳采", "入宅", "开市", "订盟", "动土", "祈福", "安葬", "祭祀", "修造", "安香", "出火", "破土"],
    ji: ["会亲友", "安床", "作灶", "造船"]
  }
};